{
    "title": "\n\n\t\t\t\t\tJedi Order\t\t\t\t\n",
    "article": "    \n\n\n\n\n\n\n\n\n\nContent approaching.\n\nParts of this article are no longer up to date. This article needs updating from multiple sources. Click the dropdown below to see the full list.\n Sources\n\nThe High Republic: Convergence, The High Republic: Path of Deceit, Star Wars: The High Republic — The Blade, Star Wars: The High Republic Adventures (Dark Horse Comics 2022) Star Wars: The High Republic (Marvel Comics 2022), Peace and Unity, The High Republic: The Battle of Jedha, The High Republic: Path of Vengeance, The High Republic: Cataclysm, The High Republic: Quest for Planet X, First Mission, What a Jedi Makes, The High Republic: Into the Dark, The High Republic: Light of the Jedi, The High Republic: A Test of Courage, A Coruscant Solstice, Star Wars: The High Republic Adventures (IDW Publishing 2021), Star Wars: The High Republic: There is No Fear, Star Wars: The High Republic: Heart of the Drengir, The High Republic: The Rising Storm, The High Republic: Race to Crashpoint Tower, Star Wars: The High Republic: Trail of Shadows, The High Republic: Out of the Shadows, The High Republic: Tempest Runner, Star Wars: The High Republic: The Shadow of the Nihil, The High Republic (2021) 11, The High Republic Adventures: Galactic Bake-Off Spectacular, The High Republic: Mission to Disaster, The High Republic (2021) 12, The High Republic: Midnight Horizon, The High Republic (2021) 13, The High Republic: The Fallen Star, The High Republic (2021) 14, The High Republic (2021) 15, Star Wars: The High Republic: Eye of the Storm, Star Wars: The High Republic Adventures: The Nameless Terror, Justice, Choices, Resolve, Master & Apprentice, The Sith Lord, Inquisitor: Rise of the Red Blade, Galactic Tales: Inheritance, Brotherhood, Hyperspace Stories 5, The Eye of the Beholder, A Jedi's Duty, Tales of Villainy: Give & Take, Darth Vader (2017) 2, Trials of the Darksaber, Doctor Aphra (2016) 2, Star Wars (2020) 20, Obi-Wan 3, Star Wars: Yoda: Light and Life, Star Wars: Yoda: Students of the Force, Star Wars: Yoda: Size Matters Not, Doctor Aphra (2020) 16, Crimson Reign 3, Revelations 1, Doctor Aphra (2020) 32, Doctor Aphra (2020) 33, Doctor Aphra (2020) 34, Shadow of the Sith, Star Wars Propaganda: A History of Persuasive Art in the Galaxy, Star Wars: Complete Locations, Star Wars: The Complete Visual Dictionary, New Edition, TIE Fighter Owners' Workshop Manual, Rise of the Separatists, Collapse of the Republic, Unlimited Power, Knights of Fate, Star Wars Jedi: Fallen Order, Shadow Fall, Halcyon Legacy 1, Star Wars: Episode IX The Rise of Skywalker, Savage Spirits,  Star Wars Helmet Collection 72 (Highlights of the Saga: Luke's Journey in the Force), The Star Wars Book, Star Wars: The High Republic: Chronicles of the Jedi\n\n\nPlease update the article to include missing information, and remove this template when finished.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe're doomed!\nThis article covers an essential topic and is in need of major additions and/or work.\nPlease follow the guidelines in the Manual of Style and complete this article to the highest level of quality before continuing on other articles.\n\n\n\n\n\n\n\n\n\n\n\n\n\nJedi Order\n\n\nOrganizational information\n\nTitle of leader\nGrand Master[1]\n\n\nGoverning body\nJedi High Council[2]\n\n\nPositions\nMaster of the Order[3]Jedi Master[2]Jedi Knight[2]Padawan[2]Jedi Initiate[4]\n\n\nSub-groups\nAcquisition Division[5]Agricultural Corps[6]Anchorite sect[7]Army of Light[5]Council of First Knowledge[6]Council of Reassignment[6]Council of Reconciliation[6]Exploration Corps[6]Jedi assault team[8]Jedi Initiate Clan[9]Jedi investigators[10]Jedi seeker[9]Jedi high command[11]Jedi Temple Guard[4]Medical Corps[6]Technical division[1]\n\n\nSects\nInquisitorius[12]Ordu Aspectu[13]Sith[14]\n\n\nHeadquarters\nJedi Grand Temple, Coruscant[15]Jedi Temple of Luke Skywalker, Ossus[16]\n\n\nAffiliated organizations\nGalactic Republic[4]Galactic Senate[17]Judicial Department[18]Hidden Path[19]Alliance to Restore the Republic[20]New Republic[21]Resistance[16]\n\n\n\nBeliefs\n\nHoly text(s)\nJedi Code[22]Sacred Jedi texts[16]\n\n\nDeities\nThe Force[22]Light side of the Force[22]Chosen One[22]\n\n\nLocations/temples\nBrighthome[23]Crucible[24]First Jedi Temple, Ahch-To[25]Jedi Temple, Batuu[26]Starlight Beacon's Jedi temple,[27] Starlight Beacon[28]Temple of the Force, Ashas Ree[29]Jedi Temple, Dantooine[30]Jedi Temple, Ilum[31]Jedi Temple, Ledeve[32]Jedi Temple, Lothal[33]First Temple, Ossus[9]Great Jedi Library[6]Jedi Temple, Tanalorr[34]Jedi Temple, Tython[6]Jedi Temple, Vrogas Vas[35]Jedi shrine, Anoat[36]Temple of Eedit, Devaron[37]Jedi Outpost, Caragon-Viner[38]Jedi outpost, Elphrona[39]Temple on Hynestia,[40] Hynestia Prime[41]\n\n\nRelics/artifacts\nDarksaber[42]Jedi holocrons[43]Kyber memory crystal[44]Jedi Crusader pendant[45]Jedi star compass[45]\n\n\nCeremonies\nThe Gathering[46]Initiate Trials[47]Jedi funeral[48]Jedi Trials[22]Knighting ceremony[49]\n\n\nHolidays\nSeason of Light[50]\n\n\n\nHistorical information\n\nDate founded\nc. 25,025 BBY[51]\n\n\nPlanet of origin\nAhch-To[52]\n\n\nFounder\nPrime Jedi[52]Luke Skywalker (new generation)[53]Rey Skywalker[54]\n\n\nDate of collapse\n19 BBY[55]28 ABY[51]\n\n\nDate of restoration\n15 ABY[51]By 50 ABY[56]\n\n\n[Source]\n\n\n\n\"Being a Jedi is not just about power, or lightsabers, or even skill with the Force. It is about connection. Being part of something bigger. I am stronger as part of the Jedi Order than I could ever be alone.\"\n―Obi-Wan Kenobi, to Anakin Skywalker[57]\nThe Jedi Order, also known as the New Jedi Order under Jedi Master Luke Skywalker, was a noble monastic and nontheistic religious order united in their devotion to the light side of the Force. With a history dating back thousands of years before the rise of the Galactic Empire, the Jedi Knights—noted for their lightsabers and natural ability to harness the powers of the Force—stood as the guardians of peace and justice in the Galactic Republic. The Order was originally established on Ahch-To in the Unknown Regions. In later years, the Jedi Grand Temple on the Core World Coruscant served as the hub of all Jedi activity in the galaxy. The Temple was also a training school for younglings and Padawans, who learned the ways of the Force under the supervision of Jedi Masters, twelve of whom were elected to serve on the Jedi High Council—the Order's highest governing authority. The High Council's staff officers were the Grand Master, who functioned as the leader of the Order and was a title reserved for the wisest Jedi Master, and the Master of the Order, who served as the Council's appointed leader. The Jedi Code governed the Order's way of life; therefore, every Jedi was duty-bound to observe and uphold the Code or else risk expulsion from the Order.\nThe emergence of the Sith Order was the result of a schism that fractured Jedi unity, dividing the Order between the Jedi who remained faithful to the light and a group of renegades that followed a rogue Jedi into exile for exploring the dark side of the Force. Thenceforth, the Jedi and Sith warred with each other for centuries. Although the last conflict concluded with the fall of the Old Republic, the ancient Sith all but perished as well, allowing a new Galactic Republic to rise under the protection of the Jedi Order. Unknown to the Jedi, however, the Sith endured in secret for a millennium beginning with Darth Bane, the sole-surviving Dark Lord of the Sith who reformed the Sith way by creating the Rule of Two—a rule limiting the Sith Order's ranks to two members: a Sith Master to embody the power of the dark side, and a Sith apprentice to covet that power. While the Jedi and Republic moved on, their ancient wars with the Sith fading from memory, Bane's legacy spawned a lineage of Sith Lords that culminated in the rise of Darth Sidious approximately three decades before the Battle of Yavin.\nDuring the final decades of the Republic, the Jedi Order vowed allegiance to the Galactic Senate as the galaxy was beset by political instability and social unrest which, in turn, created a secessionist crisis that ultimately resulted in the formation of the Confederacy of Independent Systems. Lacking the sufficient manpower needed to protect the galaxy, the Jedi became commanders and generals in the newly-formed Grand Army of the Republic. For roughly three years they commanded armies of clone troopers in a conflict known as the Clone Wars, engaging the Confederacy's battle droid forces led by Count Dooku—a former Jedi Master who became a Sith Lord—and the cybernetic warlord General Grievous. Though the Jedi fought to preserve the Republic, the government they served was secretly taken over by Sidious who, as Senator Sheev Palpatine of Naboo, rose to power in the Senate and became the last Supreme Chancellor of the Republic. The Jedi were unknowingly being deceived by the Sith.\nThe Chancellor's deceptions and machinations culminated in the execution of Order 66, a secret protocol that forcibly turned the Jedi's clone soldiers against them, leading to an all but total extermination of the Jedi Order. With the most of the Jedi eliminated, Sidious supplanted a thousand years of democracy with a new government known as the Galactic Empire. In addition, Sidious succeeded in turning Anakin Skywalker—the prophesied Chosen One who was destined to bring balance to the Force by destroying the Sith—to the dark side and renamed him Darth Vader. As a Sith Lord, the former Jedi Knight served the self-proclaimed Galactic Emperor by hunting down the few surviving Jedi, who had gone into hiding across the galaxy. In spite of the Sith's efforts, however, the Jedi continued to endure. Within a generation of the Empire's rise to power, Obi-Wan Kenobi and Yoda—both of whom survived the initial purge of the Order—trained Vader's son, Luke Skywalker, in the Jedi arts. Luke would later redeem his father, causing the redeemed Anakin Skywalker to return to the light and fulfill his destiny as the Chosen One, destroying both himself and his Master during the Battle of Endor.\nThe Empire dissolved into various remnants as a result of their defeat in the Galactic Civil War, allowing the Alliance to Restore the Republic to rise as the New Republic. Under the new era, Luke Skywalker endeavored to rebuild the Order by training a new generation of Jedi. Among Skywalker's students was his nephew, Ben Solo, the son of his twin sister, Princess Leia Organa, and the famed smuggler Han Solo. Ben, however, was seduced by the dark side of the Force at the coaxing of Snoke, an enigmatic figure who spearheaded the Imperial-inspired First Order. As a result, Ben adopted the name and persona of Kylo Ren, a First Order warlord and master of the Knights of Ren.\nThe new generation was betrayed and destroyed by Ren, who left the Jedi training temple burning by the time Skywalker recovered from the attack. Feeling responsible for Ben's fall and the massacre of his apprentices, he went into exile and disappeared from the galaxy, leaving only traces of his location on a star map. The First Order and the Resistance both sought to acquire the map, but ultimately it was the latter that succeeded due to the actions of the Jakku scavenger Rey. She followed the map to the planet Ahch-To, where the last Jedi had taken refuge in the first Jedi Temple.\nSkywalker, stricken by grief and believing his return would only cause more problems, was reluctant to train Rey or another generation of Jedi. However, the last Jedi eventually returned to the fight, buying time for the Resistance to escape the siege of Crait led by Kylo Ren, who became the new Supreme Leader after killing his master, Snoke. Skywalker became one with the Force after exerting a great amount of energy to project himself across the galaxy to face his fallen nephew, but not before acknowledging that he would not be the last Jedi. His heroic tale spread across the galaxy, inspiring others and giving hope in a time of rising darkness.\nHaving returned from death, Darth Sidious urged Kylo Ren to end the Jedi Order by killing Rey, who was his granddaughter. After Ren renounced the dark side, Sidious attempted to turn Rey until he discovered her bond with Ben Solo. Realizing they were a dyad in the Force, Sidious nearly drained them of their life force to regain his full power. Though weakened by Sidious' attack, Rey was strengthened by the spirits of past Jedi, allowing the apprentice to stand against the Dark Lord of the Sith. She destroyed her grandfather using his own Force lightning against him, preventing the rebirth of the Sith Order, but the effort left her dead. Solo resurrected her at the cost of his life, becoming one with the Force as the last Skywalker. The Skywalkers were gone, but their legacy endured through Rey, who took the Skywalker name to honor her mentors and restore the Jedi Order to its former glory in time.\n\nContents\n\n1 Description\n\n1.1 Overview\n1.2 Locations\n1.3 General perception\n\n1.3.1 Different traditions over time\n1.3.2 Public image\n1.3.3 Late Republic anti-Jedi views\n1.3.4 Pro-Jedi views\n\n\n\n\n2 History\n\n2.1 Ancient times\n2.2 Keepers of the peace\n\n2.2.1 Knights of the High Republic\n2.2.2 Beginning of the end\n\n\n2.3 Invasion of Naboo\n2.4 Separatist Crisis\n2.5 Clone Wars\n\n2.5.1 The first battle\n2.5.2 Jedi of the Republic\n2.5.3 Rogue Jedi\n2.5.4 The last stand\n\n\n2.6 The purge\n2.7 Dark times\n\n2.7.1 Fallen order\n2.7.2 Rediscovery of an abandoned world\n2.7.3 Rebellion and war\n\n\n2.8 Return of the Jedi\n2.9 An order reborn\n\n2.9.1 Stumbled Beginnings\n2.9.2 A new generation\n2.9.3 The temple's destruction\n2.9.4 The Jedi Killer\n\n\n2.10 An awakening\n2.11 Last of the Jedi\n2.12 Return of the Sith\n2.13 Legacy\n\n\n3 Behind the scenes\n4 Appearances\n\n4.1 Non-canon appearances\n\n\n5 Sources\n6 Notes and references\n\n\nDescription[]\nOverview[]\n\n\"The Order tends to be what it needs to be for any particular time. Sometimes, we're warriors, fighting the forces of evil. Sometimes, we govern. Sometimes, we do the opposite—drawing inward, studying the Force and its mysteries. Sometimes, we explore. Sometimes, we do all of those things. And sometimes… We are carved down to almost nothing. Those who are left must bear the responsibility of being one last bit of light in a galaxy filled with endless dark.\"\n―Elzar Mann, to Luke Skywalker[58]\n     For a thousand generations, the Jedi Order protected the Galactic Republic as guardians of peace and justice.  \nThe Jedi Knights[59] were a noble order of Force-sensitive protectors—united by their ability to use the Force—who upheld peace and justice in the Galactic Republic for over a thousand generations,[4] carrying out what they sensed to be the will of the Force as its instruments.[60] As keepers of the peace, the Jedi Order undertook diplomatic missions on behalf of the Galactic Senate, and pursued interplanetary criminals across the galaxy.[2] Whereas the Sith—the historic enemies of the Jedi Order—harnessed the dark side of the Force for power,[61] the Jedi followed the ways of the light side of the Force.[4] The Jedi Code,[18] along with a collection of other foundational texts,[16] guided the Jedi way of life, governing the behavior of individual Jedi to the philosophy and training regimen of the Order as a whole.[18] Though the Jedi worshipped no specific deity, the Chosen One played an important role in Jedi prophecy and mythology.[62] The virtues of the Order included compassion, generosity, peaceful resolution,[63] and spreading justice.[64]\nJedi needed to understand they were, like all people, imperfect and needed to always learn to be better.[64] The Jedi were instructed in the ways of the Order and the Force; as their knowledge grew, each member progressed through several different ranks. With the exception of Anakin Skywalker, prospective Jedi were identified a short time after birth by the quantity of midi-chlorians in their blood, a factor which indicated the level of a subject's Force-sensitivity.[22] Many of these children were listed within Jedi holocrons before being identified by the Order. Training began at the level of the Jedi Initiate; at some point in their training, younglings were expected to find their own Kyber crystal—the heart of the lightsaber,[65] a distinctive and elegant weapon of the Jedi[66]—in order to pass an ancient rite of passage known as The Gathering.[31]\n\n     Padawans were assigned to fully-trained Jedi, such as Knights or Masters, in order to complete their training in the Jedi arts.  \nYounglings who succeeded in their trials graduated to the level of Padawan, the apprentice of a more experienced member of the Order. In accordance with the Jedi Code, a Master could instruct only one student in the ways of the Force at any given time. The Padawan braid, a symbol that represented a Jedi apprentice's status in the Order, was worn in the hair[22] or head,[67] depending on the Padawan's species.[22][68] The braid was removed when a Padawan ascended to the rank of Jedi Knight or in the case of banishment from the Order's ranks.[69]\nThe Jedi Trials were a series of tests that ultimately determined whether a Padawan was worthy of the rank of Jedi Knight.[22] After becoming a full-fledged member of the Order, a Jedi could choose to adopt a Padawan of their own as part of the Order's tradition in training the next generation of Jedi.[67] Teaching the ways of the Force to the next generation of Jedi was considered one of the greatest honors in the Order, its existence and traditions perpetuated through \"a cycle of training and education.\"[18] The Eye of the Nihil, Marchion Ro, believed that being structured into an order gave Jedi an advantage; in addition to tapping into the Force, any Jedi could tap into their Order to find confidence and structure. Being part of a united group made it so individual Jedi were willing to make large–scale decisions, which they believed would spread their light throughout the galaxy. In effect, a Jedi was not merely strong and bold because they could use the Force. Instead, being part of the overall Jedi Order helped them grow to embody those traits.[60]\n\n     Comprised of twelve Jedi Masters, the Jedi High Council was the governing body of the Jedi Order.  \nThe most powerful and legendary Jedi held the rank of Jedi Master.[70] Again with the exception of Skywalker, the Jedi High Council[17]—the highest governing body of the Order[2]—consisted of Masters throughout the history of the Order.[17] Among the High Council, the title of Grand Master was conferred on the oldest and wisest member of their group,[71] while the Council's leadership rested with the Master of the Order.[3]\nThe Jedi Order in its capacity as a peacekeeping force of the Republic[8] vowed allegiance to the Galactic Senate and democracy.[17] As an \"extension\" of the Republic's Judiciary branch,[18] the Order was under the legal jurisdiction of the Senate,[72] and as leader of the Senate,[17] the Supreme Chancellor had the privilege to make requests of the Order.[72] However, this prerogative did not give the chancellor direct authority over the Order, which was legally under senatorial oversight. According to Sheev Palpatine, the Office of the Chancellor would become a dictatorship if the Order was forced to comply with orders from the Republic head of state.[73]\n\nLocations[]\n\n\"The most famous of the Jedi temples, located on Coruscant, served as the home of the Jedi High Council and the vast library of data known as the Jedi Archives.\"\n―Luke Skywalker[74]\n     The first Jedi Temple was built on a sacred island of Ahch-To.  \nJedi temples served as places of worship, training schools, and repositories of knowledge for the Jedi Order.[74] The first Jedi Temple was built atop a sacred island on Ahch-To[25] tens of thousands of years before the First Order-Resistance War.[75] The temple rose high above the surrounding sea, and was worn down by erosion and time. Some signs of its past remained, however, such as mosaics and an ancient meditation ledge.[25] One such mosaic depicted the Prime Jedi in a state of meditation; the same mosaic symbolized the nature of the Force as a duality between the dark side and the light.[76]\n\n     During the era of the Galactic Republic, the Jedi Order made its home in the Jedi Grand Temple on Coruscant.  \nThe Jedi Order made its home in the Jedi Grand Temple on Coruscant,[15] the capital world of the Galactic Republic.[77] Over the millennia, the Temple served as the central hub of all Jedi activities in the galaxy; it was a school, a monastery, and the headquarters of the Jedi High Council.[15] As a school, the Temple was the largest active Jedi training center in the galaxy[2] where younglings trained to become Padawans and ultimately full-fledged Jedi Knights. The Jedi Archives, the source of all knowledge accumulated by the Order, was located inside of the Temple.[78]\nAs the symbol of the Order, the Temple signified the Order's status in galactic affairs.[79] While access to the Temple was not restricted to just the Jedi, all non-Jedi personnel were required to undergo compulsory entry tests before becoming employed at the Temple. Those who worked in the Temple often dedicated their whole life to serving the Order.[80] Having sustained extensive damage during the fall of the Jedi, the Temple was renovated and renamed as the Imperial Palace,[15] with only the original structure's corpse and five skyscraping towers remaining intact.[81] In addition to the Temple on Coruscant, the Order maintained several ancient temples spread across the galaxy.[82] Jedi understood they were connected to the entire galaxy through their Order, seeing the galaxy itself as their home instead of a singular location as deserving that term.[64]\n\n     The Jedi Temple on Ilum was used for a sacred ritual known as The Gathering.  \nOne ancient temple was located on Lothal, and was only accessible if both the Master and Padawan were present. The Lothal temple was where Padawans were sent to confront their fear without the support of the Masters, some of whom ultimately died while waiting for their students who never returned, leaving the temple's antechambers littered with their skeletal remains.[82] Other Jedi enclaves included the Temple of Eedit on Devaron,[37][83] the Temple of Vrogas Vas,[35] and the Temple of Ilum where younglings were sent to participate in The Gathering.[31] The Jedi Order established smaller outposts at various locations around the galaxy, including one on Elphrona. These outposts dated as far back as the High Republic Era and the great Jedi spread across the galaxy[39] that saw them work alongside various communities. It contained various artifacts that were important to the history of the Jedi.[39]\nWhile Ilum was regarded as the most sacred planet to the Jedi Order,[31] the desert moon Jedha—a holy site and home to one of the first civilizations that explored the nature of the Force[84]—was considered a spiritual home of the Jedi.[85] Like Ilum,[31] Jedha contained the kyber crystals that the Jedi used to create their lightsaber.[86] It was also a holy site for pilgrims throughout the galaxy, who sought spiritual guidance[84] in the Holy City of Jedha.[87] At one time it was an important world to the Jedi.[84]\n\n     The Jedi Temple on Ossus served as a training school for the apprentices of Jedi Master Luke Skywalker.  \nA number of Jedi sites could also be found on the planets Tython and Ossus, such as the Jedi Temple of Tython[6] or the First Temple on Ossus.[9] The Jedi maintained a connection to Tython, and one of their sacred texts described \"notable beasts of Tython.\"[76] Ossus was also the location of the Great Jedi Library, which was destroyed before the Clone Wars[6] and in complete ruins by the time of its rediscovery by Luke Skywalker. Despite this, Skywalker still located an original copy of the Rammahgon, one of the sacred Jedi texts, on the planet.[76] During the New Republic Era, the Jedi Temple of Luke Skywalker was constructed on[88] Ossus[89] with the goal of becoming a \"great school\" for future generations of students in the restored Jedi Order.[88]\n\nGeneral perception[]\nDifferent traditions over time[]\n\n\"Wait— you mean, I can be a Jedi?\"\"Study you should, the Farseeker Lyr. No great power had he, yet from his ink sprang some of the Jedi's greatest texts. For though the Jedi and the Force are one, the Force is not what a Jedi makes.\"\"Then what makes a Jedi?\"\"That is something only you can answer.\"\n―Lohim Nara and Yoda during the High Republic Era[90]\n     Compassion and non-attachment were regarded as essential to members of the Jedi Order, but how they were shown differed over time.  \nWith the galaxy changing as new threats emerged, the Jedi Order took on many forms and traditions over its life[58] in its mission to fight those threats.[17] As such, the particular way members of the Jedi Order interpreted the current form of its ideals impacted the way they interacted with the galactic population.[91] The High Republic Era was a time of greatly expanded Jedi activity, and the Order had many outposts throughout the galaxy.[92] The Galactic Republic relied heavily on their role as guardians of peace and justice, to settle disputes through peaceful ways, to protect planetary leaders and senators.[22] With the Republic's rapid expansion and the Order's role in protecting that effort, the Jedi also established many new temples across the Outer Rim, keeping the buildings in line with the planetary cultures they found themselves in. With many Jedi living amongst these communities through these new temples,[60] the Jedi learned local customs and truly became part of the cultures they protected.[93]\nThe Order and the Jedi Council enabled Jedi who were drawn to solitary action to become \"Wayseekers\"—Jedi, who were operating outside of the dictates of the Council. However, even Wayseekers were bound to the values of the Order. Their abilities and skills couldn't be used in the pursuit of selfish concerns.[94] Although they were not soldiers or warriors,[8] the Jedi of the last years of the Republic became generals of the Republic Military and fought in the Clone Wars.[17] Jedi Knights of all eras adhered to the Jedi Code, however, there were debates on how to follow its doctrines,[62] and many Jedi developed their own personal understanding of them. One major concept was that of avoiding attachments, but different Jedi expressed different understandings of that rule.[95] Padawan Kevmo Zink explained the overall idea behind avoiding attachments was inspired by the Jedi Order's mission to the Force; if a Jedi was truly expected to work for the good of the entire galaxy, they could not tie themself down with one attachment, such as a romantic relationship with another being.[96]\n\n     To be a Jedi was to let go: friends would live and pass on, but a Jedi could not allow their connection to give way to uncontrolled grief.  \nIf a Jedi did form such an attachment, the Order believed that the Jedi would not be as ready to spread the ideals of the light side across the galaxy because of the relationship, which the Order taught would be a distraction. It was hoped a Jedi Knight would only be bound to the Force and the Jedi Temple.[96] During the High Republic Era, according to Master Kantam Sy's viewpoint, there were many Jedi who twisted the notion non-attachment; to Sy, those who spoke of suppressing emotions, forsaking love and trying to numb themselves to discomfort were twisting Jedi teachings. Sy, Grand Master Yoda, and many others taught non-attachment or detachment, just like love, was to let go of something or someone when the time called for it, instead of allowing oneself to be ruled by the need to possess.[95] Indeed, close friendships were respected and valued throughout the Jedi Order,[17] but a Jedi needed to understand they could lose those they cared for and thus would need to let go,[95] instead of letting their grief consume them.[17]\nThat belief tied into the Jedi Order's beliefs on death; according to the Jedi, an individual became one with the Force upon death because they transferred into the Cosmic Force, which, in turn, generated the Living Force. As High Republic Era Jedi Master Obratuk Glii explained, he was still allowed to miss his former apprentices, but he knew they were still with him through the Force, generating a joy within him that his fellows had become part of the Force. Furthermore, he declared it meant he could not be scared of his own mortality.[97] As selfless defenders of peace and justice,[17] Jedi were also willing to lay down their own lives in defense of others.[98]\n\n     The Jedi Order taught its members to move beyond what they feared to lose, ensuring a Jedi did not cling onto the present in an ever-changing galaxy.  \nAs such, a Jedi needed to be careful with their relationships[96] so as to not let attachment, and the naturally ensuing fear of losing those attachments, consume them.[17] It was not that a Jedi was not allowed to feel romantic love, as it was understood such feelings were natural, but a Jedi were not supposed to enter into a romantic relationship. It was essential for a Jedi Knight to make the right choice for the Order and not neglect their Jedi duties in the favor of their beloved, even if that would mean the end of the relationship.[99][100] As Zink explained, a Jedi was able to use the Force to direct themselves through the tides of strong emotions and learn what the underlining motivations of those feelings were. With that, a Jedi would not be ruled by their passions, but instead could make tactical decisions with a better understanding of their own mindset.[96] During the waning decades of the Republic, compassion was supposed to be central to a Jedi's life, but they don't supposed to have attachments.[17][101] Non-attachment was to not to fearfully grasp on things and beings in a universe ruled by change.[8][99][102][103][17]\nFor some outsiders, however, the Jedi teaching on the matter often misinterpreted, believed the Jedi to be distant and seemingly unconcerned about the lives of those they were to protect and that love is forbidden for a Jedi.[101][91] In the High Republic Era, one similar incident had occurred when a Jedi Knight saved the lives of a starship crew, including the young Axel Greylark, but needed to drag the badly injured boy away from his father, trapped under the rubble, thus leaving him behind. The Jedi told him that what happened was the will of the Force, something that left Greylark baffled. Years later, when he recounted the incident to Jedi Knight Gella Nattai and how the Knight later forgot his face, he concluded, one grieving boy in a galaxy full of them is nothing, however, Nattai affirmed to Greylark that one grieving boy was everything.[64]\n\n     Yoda served as a Jedi Master for centuries and thus was present to watch as the Jedi Order changed with the galaxy.  \nDuring the High Republic Era, when the young boy Lohim Nara spoke to Grand Master Yoda about his life-long desire to join the Order, he confessed that he had faked his Force-sensitivity and midi-chlorian count, but Yoda told the boy of how the Force was not the sole answer to what a Jedi was. Yoda spoke of how the Force existed in all life forms and how, if he wanted to be someone worthy of the name Jedi, he could not dwell on what he did not have. He also told the boy not to worry about being \"too old\" to become a youngling, stating that he was still learning at over six hundred years old. While Yoda seemed to admit the boy could not be a Jedi Knight due to his age, he noted that other professions helped the Order and offered him a role as a guardian of the Temple after Nara realized he had a mentor in Reina Bilass.[90]\nHowever, later in its history, the Order proved to be open to bend their rules, allowing the young Anakin Skywalker to be trained, despite he was initially deemed too old.[22] Decades later, Yoda chose to take Luke Skywalker as his apprentice, who was possibly the oldest Padawan in the Order's history.[104] The Order of the High Republic also became a home for the young Force-sensitive Zeen Mrala, who did not train as a Jedi but became close to many Padawans and, despite Jedi regulations forbidding its members from engaging in romance, fell in love with Padawan Lula Talisola.[95] Despite not being a Jedi, she was welcomed to train with the Padawans and their masters, with Talisola's master Kantam Sy helping her to control her anger.[105] Later, in order to find and save Talisola, Mrala realized that she was willing to join the ranks of the Jedi despite her age, although her realization came from how she figured certain Jedi rules would be bent due to the evolving Nihil conflict.[95] The High Republic Era Order also maintained close ties with other Force orders, working as part of the Convocation of the Force on Jedha.[96] Through its ties to other orders, the Jedi brought rescued children who were \"too old\" to be trained as Jedi to Jedha, where they were taken in by other faiths.[64]\n\n     For Luke Skywalker, surrendering to one's attachments was to forsake the ways of the Jedi Order.  \nLuke Skywalker affirmed the Jedi Order's commitment to non-attachment since the early days of his efforts to rebuild it.[88] However, he also told his sister, Leia Organa, that she could still be married to Han Solo if she joined the Order.[106] Due to his unorthodox training in the Jedi arts, Skywalker sought to provide the next generation of Jedi with a more conventional path to knighthood.[74] As the last Jedi of his era,[39] Skywalker found comfort through adherence to the Jedi way, having largely isolated himself from his friends while rebuilding the Order.[89] In addition, the Armorer—a Mandalorian who was familiar with Jedi history—stated that the Jedi were required to sacrifice personal attachments in order to master the ways of the Force.[107] While in the process of training Grogu, Skywalker informed his apprentice that giving into attachments to those whom he loved was to forsake the way of the Jedi.[88]\n\nPublic image[]\n\n\"The Jedi Order was strong, deeply seated into the galaxy's consciousness. They had a great temple in the heart of Coruscant, worked closely with the Republic and its chancellor for centuries. People made holodramas about them, wrote stories. The Jedi were…celebrities, and rightly so.\"\n―The Archivist[108]\n     The Jedi were committed in their duty as guardians of the Republic, but had no desire to be celebrated as such.  \nThe Jedi Order was regarded as a mysterious organization throughout its history.[109] The Order was ingrained in the public consciousness of the galaxy as a result of its strong ties to the government of the Galactic Republic,[108] but was nonetheless inscrutable to the general public. However, those who encountered the Jedi were awed by their Force abilities.[109] Nevertheless, the Jedi were celebrities of their time, a status reflected by Jedi-themed holodramas as well as stories written about the Order. The Archivist, a historian who studied Jedi lore prior to joining Crimson Dawn, believed that to most people the Jedi exemplified the moral virtues that were affiliated with the light side of the Force, making them both loved and hated by the galaxy that they served.[108]\nDuring the High Republic, the Jedi actively worked to be part of local communities[110] in addition to helping them.[93] However, the Path of the Open Hand cult spread its influence by claiming all who used the Force were violating the energy field from its freedom, claiming that each use of the Force to solve a problem created an equal or worse problem elsewhere.[111] The people of the planet E'ronoh were divided on the Jedi, with some believing they were miracle workers while others looked down on the Order as a group of Republic-backed outsiders. The arrival of the Path galvanized anti-Jedi sentiment on E'ronoh.[64] During the Clone Wars, the Commission for the Protection of the Republic (COMPOR) initially attempted to use the Order as an instrument for wartime propaganda. This idea was discouraged by Supreme Chancellor Sheev Palpatine, who noted the Jedi's discomfort with their new role as generals in the Republic Military. COMPOR therefore focused its propaganda on the clone troopers who served under the Jedi's command, and as such the Jedi's contributions to the Republic war effort went largely unnoticed.[109]\nIn general Republic citizens were unaware of the Order's motives for fighting in the Clone Wars, and to some individuals[109] such as the Mandalorian Duchess Satine Kryze[100] or the Coruscanti civilian Letta Turmond, the Jedi had forsaken their principles as peacekeepers by becoming military leaders and battlefield warriors.[112] Tee Watt Kaa, the head of a Lurmen village on Maridun, rejected the argument that the Jedi were peacekeepers, a function that he believed was incompatible with the Order's participation in the Clone Wars.[103] A committed, to the death, pacifist, Kaa was unwilling to compromise his views, refusing to permit the other Lurmens to defend their village against the Confederacy military. They ultimately defied Kaa's authority upon witnessing the Jedi's efforts to save the Lurmens from extermination by General Lok Durd.[113]\n\n     When the Jedi became military generals during the last years of the Republic, many took them as warmongers who had abandoned their peacekeeping mission.  \nAt the height of the Clone Wars, people throughout the galaxy regarded the Jedi as warmongers, particularly in territories controlled by the Confederacy of Independent Systems. However, most beings did not know that the Order went to war to honor its commitment to protect the Senate, the Republic,[109] and the galaxy at large.[114] Nevertheless, the Clone Wars caused civilians like Turmond[112] and the Martez family to lose faith in the Order.[115] Rafa Martez and her sister, Trace Martez, faulted the Order for the deaths of their parents during an incident on Coruscant in which the Jedi attempted to recapture the Hutt crime lord Ziro Desilijic Tiure. The Jedi who had been forced to redirect a transport, which crashed into their apartment in her efforts to ensure it avoided hitting a platform of people, failed to properly explain herself in a compassionate matter and claimed the Force would be with them both, which meant nothing to the two girls.[91]\n\nLate Republic anti-Jedi views[]\n\n\"Emperor Palpatine rose to power because he made people afraid. He made people fear the Jedi. He called them traitors. He said they used their mystical powers to subvert democracy and peace, to cause war. It worked, possibly because as much as people loved the Jedi, they also hated them, on some level. It is hard to look at people who have become their best selves. It reminds you that you have not.\"\n―The Archivist[108]\nPublic discontent with the Galactic Senate led to manifestations of anti-Jedi sentiment during the late Republic Era.[116] As an extension of the Galactic Republic's Judicial Department, the Jedi Order was subject to the authority of the Senate,[18] and therefore, considered an instrument of the government's will. This belief was held both within the Senate[117] and without;[116] Senator Dagonet said that the Jedi served the Senate,[117] and Semage of Raxus Secundus accused them of being \"lapdogs\" for the Republic government. Hostility toward the Jedi extended to violent acts against members of the Order, such as Jedi Master Katri who was killed by Semage and his guards.[116] Jedi Master Dooku became disenchanted with both the Senate and the Order, claiming that the Jedi served a \"corrupt Senate\" that had \"failed the Republic\"[118] in contrast to his former belief that the Jedi were servants of the Republic and its people.[117]\n\n     Anti-Jedi sentiment grew as a result of the Order's involvement in the Clone Wars.  \nThe Jedi Order was vilified during the Clone Wars by elements within both the Republic and the Confederacy. The Separatists accused the Jedi of hypocrisy, claiming that the Order supported the Republic's inhumane practice—as portrayed through Separatist propaganda—of using clones as a \"slave army.\" The Separatists' portrayal of the Jedi largely succeeded in maligning their character in the eyes of the public, as few in the Confederacy knew that the Order was not given a choice in the matter. It was the Order's preference to not be used as icons of heroism, having long resisted attempts at romanticizing the Jedi, especially for the purpose of wartime propaganda. The Jedi, therefore, were mostly absent from galactic culture, which allowed anti-Jedi sentiment to grow from preconceptions instead of a genuine rebuttal of the Order's practices. The Separatists were convinced that the Order neglected their worlds, forcing them to secede from the Republic. Separatist civilians conflated the Order with the Core Worlds' reputation for cultural elitism, and some even viewed the Jedi as \"evil\" and a fanatical sect of \"warmongers.\" The historian Janyor theorized that such misconceptions of the Jedi could have been averted if the Order had been more engaged with the populace.[109]\nAnti-Jedi sentiment was openly espoused by the Republic's successor, the Galactic Empire.[109] The self-proclaimed Galactic Emperor Sheev Palpatine accused the entire Order of treason, maligning the Order's reputation[63] after several members of the High Council, having discovered his true identity as a Sith, attempted to arrest the chancellor.[17] Grand Vizier Mas Amedda publicly denounced the Order as a symbol of fear and referred to the Order's downfall as the beginning of a new \"age of freedom.\"[119] With the exception of individuals like Lyra Erso, the Order was effectively forgotten by the galaxy during the early days of the Imperial Era.[63] Despite the Alliance to Restore the Republic largely having pro-Jedi views,[120] its individual members were not immune to the era's bias, with soldier Reyé Hollis believing stories he heard of the Jedi being ineffective fools who stole glory for themselves.[121]\n\nPro-Jedi views[]\n\n\"But at what cost? It's like you once said. Many lives get caught between the Republic and the Separatists.\"\"I did say that once, but after watching the heroics and selflessness of the Jedi, I do believe the Republic is the right side to be on.\"\n―Ahsoka Tano and Lux Bonteri[122]\n     Lyra Erso was a spiritual woman who supported the Jedi Order out of reverence of the Force.  \nPrior to the Clone Wars, the people of the Galactic Republic kept faith with the Jedi Order[123] that had acquitted itself through a thousand years of loyal service.[18] Lyra Erso, the wife of Doctor Galen Walton Erso, supported the Order's views on charity, compassion, and peace. Erso's support for the Order was rooted in her faith in the Force, which evolved from her lifelong love of nature, and her belief in the concepts of good and evil. The Force, as Erso viewed it, was the epitome of perfection and good. During the Clone Wars, Erso believed that the Order was the Republic's best defense against the \"powers of evil.\" Erso also admired the Jedi Temple on Coruscant for its elegance and location on a Force nexus. She often exercised on the Temple grounds prior to the Clone Wars; after the conflict began, however, Erso noticed a changed atmosphere at the now heavily patrolled temple district, which made the area virtually inaccessible to the public with the exception of individuals who carried high security clearance.[63]\nErso's pregnancy was the closest she felt to experiencing the Force in the way that she imagined the Jedi's connection to it—an incomprehensible and \"profound connection with life.\" She recognized the Force as the source of the Jedi's power, granting them abilities that far exceeded Erso's strengths and intuition. However, she comforted herself with the belief that while she could not use the Force as the Jedi could, she was able to sense it nonetheless. In the aftermath of the Order 66, Erso rejected the Galactic Empire's explanation for the Great Jedi Purge, refusing to believe that the Jedi betrayed the Republic. Whereas the public generally accepted the deaths of thousands of Jedi, largely out of relief over the end of the Clone Wars, Erso was heartbroken by the Order's destruction and cried for hours as a result, an experience she likened to the loss of a family member. Despite the eradication of the Order, Erso continued to believe in the Jedi whose principles influenced her sense of morality.[63]\n\n     Though a former Separatist, Lux Bonteri grew to see the Jedi as heroes for their role in the liberation of Onderon.  \nIn addition to Erso,[63] the Jedi's deeds won the respect and admiration of individuals who worked closely with the Order, such as Cham Syndulla[124] and Lux Bonteri.[122] During the Battle of Ryloth of the Clone War, Syndulla was initially hesitant to accept the Order's offer of an alliance between the Grand Army of the Republic and the Twi'lek Resistance, knowing that the Republic would occupy Ryloth in the battle's aftermath.[125] Ultimately, though, Syndulla developed a newfound respect of the Jedi for their role in the liberation of his homeworld, particularly Jedi General Mace Windu, whose memory the Twi'leks honored in songs dedicated to the liberation of their homeworld.[124] Bonteri worked with the Order during the Onderonian Civil War,[122] having joined the Onderon rebels after his mother, Separatist Senator Mina Bonteri, was assassinated at the behest of Count Dooku.[126] By training and fighting alongside the Onderon rebels, the Jedi changed Bonteri's views on the Republic and the Order. Inspired by the selflessness and heroism of the Order, Bonteri vowed to restore the union between Onderon and the Republic.[122]\n\nHistory[]\nAncient times[]\n\n\"For over a thousand generations the Jedi Knights were the guardians of peace and justice in the Old Republic. Before the dark times. Before the Empire.\"\n―Obi-Wan Kenobi[59]\n     The Jedi Order began with the Prime Jedi a thousand generations before the Battle of Yavin.  \nThe precursors of the Jedi were the Dai Bendu,[127] but the Jedi Order itself was founded in the distant past on planet Ahch-To by the Prime Jedi[52] around 25,025 BBY.[51] At the dawn of their order,[31] the Jedi came into possession of Ilum, an ancient planet encased in ice and littered with kyber crystals, the heart of the Jedi lightsaber. Considered the Jedi Order's most sacred world, its ancient Temple would eventually host the Gathering, a tradition that would continue up until the fall of the Order.[31] As the Jedi were spread throughout the galaxy, they acquired a vessel called the Crucible that would ferry students to Ilum so that they could perform the Gathering. It would become the base of the architect droid, Professor Huyang, for over a thousand years as he instructed on lightsaber designs and kept records of every single Jedi weapon created.[46][128] During this early period, the Order also established itself on Ossus, Jedha, Xenxiar, and other worlds.[129] Later, some Jedi scholars argued that a number of locations could be considered the birthplace of the Order. The scholars argued that Coruscant, Jedha, and Ossus as well as worlds shrouded in myth, such as Tython and Ahch-To could all be considered candidate worlds for the Order's birth and the location of the first Jedi temple.[6]\nThe Jedi religion, as it was called by Luke Skywalker,[16] was based around eight \"sacred texts\" that \"describe tenets, history, and specific guidance to those studying the path of the Jedi.\" These texts included the Rammahgon and the Aionomica—separated into two volumes, Aionomicum I and Aionomicum II. These books included a number of aspects of the Jedi religion that appeared to have little influence on later Jedi, such as references to \"gods\" and the World Between Worlds. They also included more mundane information, such as lightsaber designs. The theology of the Jedi religion changed over time; many Jedi, such as Master Odan-Urr, annotated even the sacred texts. Much was added to the Jedi canon over time, giving rise to the belief that the Aionomicum II doubled in size during its compilation.[76]\n\n     The Hundred-Year Darkness saw a schism within the Jedi Order, with the followers of the dark side becoming known as the Sith.  \nThe Sith and the Jedi were once considered \"brothers\" in the Force prior to the Hundred-Year Darkness,[35] from which the Sith Order was born.[35] A rogue Jedi had come to believe that the true power of the Force lay not in contemplation and passivity,[14] and instead sought abandon and strength through the dark side of the Force.[130] The Jedi High Council at the time balked at this new direction, and the fallen Jedi was cast out of the Order's ranks. In spite of his banishment, the outcast gained followers to his new order.[14] The power-hungry[14] Sith sought to control the galaxy and opposed the Jedi, against whom they waged a series of wars which brought destruction to many worlds, including the Sith homeworld of Moraband, which the Sith were eventually forced to abandon.[131] On another occasion, the Jedi Order and the Sith fought a battle on the planet Takodana.[132] These wars also saw the construction of ancient superweapons powered by giant kyber crystals which possessed the power to destroy entire planets. These weapons, along with the crystals, were destroyed and a thousand years later believed by many Jedi to be merely legends.[133]\nAbout five-thousand years before the Battle of Yavin,[81] the Order eventually came to be headquartered at Coruscant, wherein they built a Temple that would pose as their main hub for thousands of generations.[134] Underneath the structure lay buried an ancient Sith shrine, the inherent power of which was believed by the contemporary Jedi to have been neutralized and successfully capped. In truth, that power had seeped upward and outward since its entombment, infiltrating the hallways and rooms above, and weakening the Jedi Order for millennia without their knowledge.[81]\n\n     The Jedi Knights protected the galaxy as the guardians of peace and justice since the time of the Old Republic.  \nIt was during this time that the Jedi Order came into the service of what would be later called the Old Republic. Promising to uphold its ideals, the Jedi fought to maintain peace and freedom. When the Old Republic outlawed slavery, the Jedi set about to free those held, notably under the Zygerrian Slave Empire. The Jedi declared war on Zygerrians, whose economic success had resulted from enslaving beings from all corners of the galaxy before selling them at auctions. The Jedi Order managed to put an end to their practices, destroying their empire and exiling them to their homeworld, Zygerria. The Zygerrians developed a fierce hatred for the Jedi as a result.[135][136][137]\nAt one point, a Jedi sect known as the Ordu Aspectu broke off from the Jedi Order. Led by the enigmatic Rur and his second in command, Amon, they sought to achieve the secrets to immortality. Eventually, a conflict broke out between them and the orthodox Jedi. The conflict ended with the signing of a peace treaty. The treaty allowed the Ordu Aspectu to continue their research but under Jedi scrutiny. During his experimentation, Rur attempted to copy his intellect into his citadel's computer core, only to accidentally transfer his very sentience as well. When the Jedi sought to investigate the computer closer, the computer activated the citadel's security droids, killing all members of the Ordu Aspectu and Jedi alike; but not before it was deactivated by Rur and Amon before they died themselves, thus ending the Ordu Aspectu.[13]\nConflicts also arose between the Jedi and the inhabitants of the world of Mandalore who had rapidly developed into a warlike culture in which strength was valued above all else. Their beliefs of continual warfare went contrary to the Jedi's mission of protecting the weak, they quickly mobilized to stop the destructive Mandalorians from expanding in the galaxy. The constant warfare was a strain and, as the Old Republic crumbled, the Mandalorian warriors sacked the Jedi Temple on Coruscant, an event during which Pre Vizsla's ancestors stole the Darksaber.[42]\n\n     Though defeated by the Jedi, the Sith would survive for centuries as a result of Darth Bane's reforms.  \nPrior to 1032 BBY,[138] the galaxy entered an era known as the Dark Age. During this time the Jedi-Sith War occurred. Early on in the war, the Sith attacked and captured Coruscant and with it the Jedi Temple. Towards the end of the war the Jedi reclaimed the Republic capital and their temple during the liberation of Coruscant.[109]\nEven as the Old Republic collapsed, the Jedi emerged victorious from their wars with the Sith.[109] In their constant thirst for power, the Sith had weakened themselves through infighting,[131] which allowed the Jedi to defeat the weakened Sith.[139] Unbeknownst to the Jedi at the time, Darth Bane remained as the sole surviving Dark Lord of the Sith. As a result of the infighting that weakened the Sith,[131] Jedi Knights[140] were able to defeat the Sith at[81] the Mid Rim planet[141] Ruusan[142] This confrontation nearly destroyed the ancient Sith Order,[139] and forced the Sith to go into hiding.[81] After this, Bane established the Rule of Two, declaring that the Sith thenceforth would consist of a Sith Master and a Sith apprentice.[139] Bane's Rule of Two was discovered by the Jedi,[143] but, according to an imprint of later Jedi Elzar Mann, the Jedi Order ended Bane's reign.[144] His death falsely convinced his enemies that the Sith had truly died out.[143]\n\nKeepers of the peace[]\nKnights of the High Republic[]\n\n\"I just didn't realize the Jedi ever had an official presence so far from the Core.\"\"It's probably High Republic Era. It was a time of greatly expanded Jedi activity throughout the galaxy.\"\n―Luke Skywalker and Lor San Tekka[39]\nThe formation of the modern Galactic Republic heralded a new era of democracy, peace, and prosperity under the Galactic Senate and its elected leader, the Supreme Chancellor.[109] Due to the Galactic Republic's demilitarization, the Jedi Order fully embraced their responsibilities as peacekeepers and rejected their roles as soldiers. Assisted by the Republic Judicials, the Jedi were responsible for maintaining law and order, namely by mediating conflicts to bring about peaceful solutions between various rival factions and planets,[81] as well as serving as interplanetary law enforcement by pursuing wanted and dangerous criminals, pirates, and smugglers. While they ultimately collapsed, the Galactic Republic and the Jedi Order were able to preside over a thousand years of peace sustained without major warfare.[2] One of their philosophical sayings was \"the simplest gesture of kindness can fill a galaxy with hope.\"[145]\nIn approximately 319 BBY,[146] a copy of a third volume of the Aionomica was put forth. Though the existence of Aionomicum III had been rumored, this volume was later found to have been forged, causing a scandal.[76] The Republic reached the zenith of its power and influence in a time remembered as the High Republic Era. During that time, the Republic relied heavily on the Jedi Order to render aid and settle disputes through peaceful methods.[18] The Jedi worked alongside the Republic in its effort to expand into the Outer Rim Territories, believing it also presented a chance to meet new groups and let them know they could rely on the Jedi for help. However, an investigation into the stolen Rod of Seasons brought the Jedi into conflict with the Path of the Open Hand cult, which sought to use members of the Nameless species against Force users in the name of \"freeing\" the Force.[96]\n\n     The Jedi Order reached its zenith of power in the High Republic Era.  \nThe Jedi Order fought in[147] the Republic-Togruta conflict.[148] Padawan Sav Malagán fought alongside pirate queen Maz Kanata's crew during the Battle of Jedha.[149] The Republic and Jedi's close connection resulted in the massacre on Dalna[40] during the conflict with the Path.[150] Even though some of its members would come to question whether it was right to do so, with Jedi like Cohmac Vitus remembering the massacre on Dalna as proof that the Republic and Jedi could not always act as one force,[40] the Jedi continued to work closely with the Republic, with each organization respecting the strengths of the other. Thus, the Jedi aided the Republic Defense Coalition and—through their outposts built to explore and help people in the wild portions of the Outer Rim—became the only group upholding justice in the Outer Rim Territories before the dedication of the Starlight Beacon. During the era, the Order's understanding of the Force was expanded thanks to the actions of Jedi Knight Elzar Mann, who liked to \"experiment\" with his Force techniques in ways that sometimes failed. Even though he never attempted such actions when lives were at stake, his experiments often meant he worked alone.[60]\nDespite the High Republic's supposed peace, the Jedi were suddenly faced with a crisis during the Great Hyperspace Disaster in the Hetzal system when the transport Legacy Run was destroyed in hyperspace, making its remains rain upon the system. Jedi Master Avar Kriss commanded the rescue operation, yet she learned via her Force bond to the other Jedi that the fragments raining upon the Hetzal system contained living beings, forcing them to begin rescue operations as well. Towards the end of the crisis, the Jedi worked together—ultimately being joined in the Force by members of their Order who were even further away—to push a fragment containing liquid Tibanna past the system's R-class star. Their successful rescue of the system was broadcasted across the Outer Rim and even reached the Republic's inner planets. Unknown to the Jedi, the disaster had been masterminded by Eye of the Nihil, Marchion Ro, who wanted revenge on the Jedi due to past events involving their Order, his family, and an artifact[60] that controlled a being known as the Great Leveler,[148] which was a member of the Nameless species[151] and thus could overwhelm Jedi and other Force-sensitives.[148]\n\n     The Nihil disrupted the peace of the High Republic Era by waging a conflict with the Jedi Order and the Galactic Republic.  \nWhile Ro was not one to share details on what had exactly happened, sometime in the Ro family's past, \"the faithful\" amongst them fought the Jedi because of their differing opinions on \"balance,\" only for the Ros, who felt the Jedi were leading the galaxy towards its destruction, to be beaten back, with their religion mostly falling out of favor as time went by.[148] Inheriting the family goal of revenge and the title of \"Eye\" after his father Asgar was murdered, Ro plotted to reform the Nihil raiders into a unified force he could use for his ends and to beat back the expanding Republic.[60] Additionally, the remains of the Legacy Run continued to rain upon Outer Rim systems as Emergences, forcing the Republic to blockade hyperspace routes and making the Jedi Council realize the Jedi would be needed in the Outer Rim more than normal. In time, the Order began to battle the Nihil, only for Ro to cement his control over the raiders after the Battle of Kur.[60]\nThe Republic underestimated the Nihil until the massive attack on Valo, where the raiders cut down Jedi and civilian alike amid the Valo Republic Fair, which was supposed to be Chancellor Soh's show of unity for the Republic. When the Jedi launched a counterattack through the Battle of Grizal, Ro unleashed the Great Leveler, which petrified Jedi Master Loden Greatstorm,[148] leaving the Jedi to realize their enemy had a weapon they did not yet understand.[152] The Republic and Jedi Order grew closer during the Nihil conflict, with Soh and her aides even continually trying to become part of the Jedi High Council's meetings. As debate on how involved with the Republic they needed to become spread across the Order, many Jedi expressed worry that the Order's focus was at risk of moving to politics and war. Vitus was one such Jedi who questioned how much the Order actually owed the Republic, even though he agreed the Nihil were a serious threat, while his Padawan Reath Silas saw both sides to the debate.[40]\n\n     Starlight Beacon was destroyed during the conflict between the Jedi Order and the Nihil.  \nAs the conflict and bloodshed carried on across the Galactic Frontier, more and more Jedi fell in battle against the Nihil, who the Jedi came to see were ruthless enemies who lacked any form of honor. Many Jedi had trouble adapting to the newly war-torn Outer Rim they needed to serve in. With it even coming to seem like acting only as peacekeepers was a recipe for defeat, Vitus came to believed the galaxy had grown to become a different place than the type the Jedi Order was made for and refused to finch in battle.[95] After Ro unleashed more Nameless during the destruction of Starlight Beacon, the Jedi Order's reputation took a hit when it ordered a mass recall of its members back to Coruscant; while Grand Master Pra-Tre Veter argued the Jedi needed to retreat until they could learn how to fight the Nameless, some Republic officials took it as the Jedi running away in fear.[153]\n\nBeginning of the end[]\n\n\"Do you think the Jedi will truly keep peace if they continue to take everything the Senate says as law?\"\"Luckily, we are guided by our Council and not by politics nor ego.\"\n―Dooku and Mace Windu[116]\n     Premonitions of a galactic conflict caused Jedi Master Sifo-Dyas to commission the creation of a clone army.  \nPrior to the Invasion of Naboo, Jedi Master Sifo-Dyas served on the Jedi High Council until he was removed from its ranks for advocating the mobilization of a Republic Military to defend the galaxy.[154] Through the Force, Sifo-Dyas predicted a galactic conflict but the High Council at the time considered his views radical.[155] Certain in the accuracy of his Force visions, Sifo-Dyas secretly commissioned the inhabitants of Kamino to grow an army of clone soldiers[154]—genetically engineered for growth acceleration and increased docility[8]—for the Republic. Unbeknownst to Sifo-Dyas, however, his plan factored into the designs of the Sith.[154] For a millennium, generations of Sith Lords plotted revenge against the Jedi Order after the death of Darth Bane. Darth Sidious, who had become a Sith Master after betraying and murdering his master Darth Plagueis, was the culmination of the Grand Plan that would see the Sith returned to a position of dominance over the galaxy.[143]\nAfter serving as an unwitting pawn for the Sith, Sifo-Dyas was betrayed by his childhood friend,[9] the Jedi Master Count Dooku, who had him assassinated by the Pyke Syndicate at the behest of Sidious.[154] Disillusioned with the Jedi Order, yet also ambitious for power, Dooku rejected the light side and became a Sith Lord, adopting the moniker of Darth Tyranus,[156] and replacing Darth Maul as the Sith apprentice of Darth Sidious.[157]\nThe Sith guided the creation of the clone troopers after Sifo-Dyas' death, covertly taking control of the army[154] and its Kaminoan developers. Tyranus maintained secret contact with two officials of the Kaminoan government, Prime Minister Lama Su and the Chief Medical Scientist Doctor Nala Se,[158] who were supplied with behavioral modification biochips to ensure the clones' compliance with their[158] Sith programming.[159] The chips were implanted in the brain of every clone trooper during the early stage of their development;[160] Sifo-Dyas, who originally thought of the chip, intended for it to be a safeguard against rogue Jedi, but Tyranus and Sidious retooled the chip. Tyranus deceived the Kaminoans into believing Sifo-Dyas' intention.[158] However, the biochip's true purpose was to guarantee that the clones would carry out Order 66,[161] a secret protocol[160] that was integral to the destruction of the Jedi Order.[162]\n\nInvasion of Naboo[]\n Main article: Invasion of Naboo\n\n\"At last we will reveal ourselves to the Jedi. At last we will have revenge.\"\n―Darth Maul, to Darth Sidious —  Listen (file info)[22]\n     Anakin Skywalker was the Chosen One discovered by the Jedi in the late Republic Era.  \nIn 32 BBY,[55] Supreme Chancellor Finis Valorum requested the Jedi Order's assistance in negotiating a dispute that resulted in the Trade Federation's blockade of the planet Naboo. The High Council dispatched Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, to negotiate with the Trade Federation. However, Darth Sidious, whose public persona was Senator Sheev Palpatine of Naboo, insisted that the Trade Federation, which was under his sway, initiated an invasion of Naboo and overwhelmed the Royal Naboo Security Forces. Circumventing a trap by the Federation, Jinn and Kenobi were able to escape to Naboo and arrive in Theed in time to rescue the Naboo Queen, Padmé Amidala, who was being held captive by Federation forces. Together with the Queen's Handmaidens and her close security detail, the Jedi fled the planet but their ship was damaged in the escape, causing them to land on the desert planet of Tatooine.[22]\n\n     After a thousand years in hiding, the Sith revealed themselves to the Jedi during the Invasion of Naboo.  \nWhile stranded on Tatooine, the two Jedi discovered a young slave named Anakin Skywalker. Jinn believed Anakin to be the Chosen One, the one that would bring balance to the Force. By betting on the boy winning the Boonta Eve Classic, Jinn was able to secure both Skywalker's freedom and the needed parts to repair the Queen's ship to reach Coruscant. It was after this that Jinn was attacked by Darth Maul, apprentice to Darth Sidious, who had dispatched Maul to kill the Jedi. As the Jedi had believed the Sith to be extinct, Jinn was at first unsure of who Maul was except that he had been trained in lightsaber combat. Arriving at the Jedi Temple on Coruscant, the Council refused to induct Skywalker into the Order because, according to the the Code, he was too old. The Council then ordered Jinn and Kenobi to protect Queen Amidala on her return to Theed. At the same time, Amidala was deceived by Palpatine into calling for a Vote of No Confidence in Chancellor Valorum, which would eventually lead to the election of Palpatine to the chancellorship. Jinn and Kenobi then assisted Amidala and her forces during the ensuing battle against the Trade Federation, when Maul killed Jinn in combat, only for the Sith to be defeated by Kenobi. Given the status of Jedi Knight afterward, Kenobi took Skywalker as his apprentice, despite Yoda's reluctance,[22] and the Jedi Order was left in the dark as to what the Sith's actions were for ten years.[55][8] The Jedi were left unaware that they were being deceived by Palpatine, who was using his double identity to eventually complete the Sith's revenge by destroying the Jedi and taking over the Republic.[17]\n\nSeparatist Crisis[]\n Main article: Separatist Crisis\n\n\"I will not let this Republic that has stood for a thousand years be split in two. My negotiations will not fail.\"\"If they do, you must realize that there aren't enough Jedi to protect the Republic. We're keepers of the peace, not soldiers.\"\n―Sheev Palpatine and Mace Windu[8]\n     The Separatist Crisis threatened to end the era of peace established by the Republic and the Jedi.  \nHaving broken all ties to the Jedi Order, secretly replacing Maul as Sidious' apprentice, Dooku was believed to be a mere \"political idealist\" by his peers at the Jedi Order.[8] For eight years, Dooku was scarcely heard about until he staged a theatrical return to public life by delivering a rousing speech that condemned the Republic and essentially set the stage for the Separatist Crisis. At the same time, he fomented political turmoil in many worlds, including Ryloth, Kashyyyk, Sullust, and Onderon, or tried to convince their leaders to leave the Republic, as in Eriadu's case.[81] Soon enough, Dooku became the face of the Confederacy of Independent Systems, convincing several thousand systems to leave the Republic.[8]n\n\n     Jedi Knight Obi-Wan Kenobi journeyed to Kamino where he discovered the creation of a clone army.  \nThe Jedi Order was unable to ensure the Republic's safety in the event of a war due to its limited numbers. The Republic lacked a standing army, while the mandate of the Jedi was to maintain order as peacekeepers instead of soldiers. Concerned by the growing number of star systems seceding from the Republic, the Senate debated the Military Creation Act. During the debate, a plot to assassinate Senator Amidala forced the Naboo senator to return to her homeworld with Padawan Anakin Skywalker serving as her bodyguard. The task of investigating the plot against Amidala was given to Skywalker's master, Jedi Knight Obi-Wan Kenobi, who tracked the assassin to the planet Kamino.[8]\nAfter discovering the Kaminoans' creation of the clone army at the behest of the late Jedi Master Sifo-Dyas, Kenobi deduced that the army's clone template, the bounty hunter Jango Fett, was the assassin who tried to kill Amidala. Jango and his cloned son, Boba Fett, fled from Kamino to escape interrogation by the Jedi. However, Kenobi followed the Fetts to Geonosis where he discovered the Separatist Droid Army, prompting the Senate to empower Chancellor Palpatine to unilaterally create the Grand Army of the Republic.[8]\n\nClone Wars[]\nThe first battle[]\n Main article: Clone Wars\n\n\"I have to admit that without the clones, it would not have been a victory.\"\"Victory? Victory, you say? Master Obi-Wan, not victory. The shroud of the dark side has fallen. Begun the Clone War has.\"\n―Obi-Wan Kenobi and Yoda[8]\nAs the Republic prepared for war, Jedi Master Mace Windu led a Jedi assault team to rescue Kenobi on Geonosis. The Jedi confronted the Separatists in the Geonosian Petranaki Arena, destroying many battle droids but also sustaining a large number of casualties,[8] including Tan Yuster,[163] Sar Labooda,[2] and Coleman Trebor.[8] The remaining Jedi were evacuated from the arena by the Republic clone army that arrived on Geonosis under the command of Grand Master Yoda.[8]\n\n     Through the combined efforts of Jedi and clones, the Republic defeated the Separatists in the first battle of the Clone Wars.  \nAlong with the requisite LAAT gunships and AT-TE walkers, over eighty regiments of clone troopers[6] engaged the droid army with the Jedi leading the charge.[8] Although the Jedi had not yet received a formal commission in the newly formed Grand Army,[6] the clones nonetheless complied with their orders. Windu, Kit Fisto, Aayla Secura, and other Jedi fought alongside their troops on the battlefield while Yoda was occupied with overseeing the Republic army's strategy from the forward command center. The Republic attack caught the Separatist leaders by surprise; despite their initial efforts to organize an effective counterattack, the Separatists ultimately retreated from Geonosis[8] as the clones achieved ground and air supremacy under the skilled leadership of the Jedi High Council.[6] Although the First Battle of Geonosis concluded as a victory for the Republic, Yoda lamented its outcome as the beginning of the Clone Wars.[8]\n\nJedi of the Republic[]\n\n\"We do what we have trained our whole lives to do. Trust in the Force. Believe in the path that is set out before us. Stand in defense of all peoples, not just of the Republic, but across the galaxy. We do what any Jedi would when staring into the face of evil. We fight.\"\n―Mace Windu[114]\n     The advent of the Clone Wars forced the Jedi to lead the Grand Army of the Republic.  \nThe aftermath of the battle on Geonosis saw the Jedi commissioned as officers of the Republic Military, with the military rank of Jedi General bestowed to Knights and Masters,[164] and the rank of Jedi Commander to Padawans.[67] The Jedi Military Integration Act formallized this and offically made the Jedi Order a part of the Republic Military.[165]\nThe Order experienced division in its ranks at the onset of the Clone Wars with Prosset Dibs opposed to the Jedi's involvement in the Clone Wars. Although Mace Windu believed that the Jedi should strive to serve as an example by leading the Republic's soldiers on the battlefield, he was affected by the loss of Jedi lives early in the conflict nonetheless. Windu was troubled by the prospect of more Jedi dying as a result of the Order's decision to fight in the Clone Wars, but Yoda counseled his colleague to set aside his doubts and trust in the Force, acknowledging Windu for his wisdom and capable leadership.[164]\nFollowing the operation on Hissrich, Windu called on the High Council to grant clemency to Dibs whose opposition to the war led to his attempt to kill Windu. Despite his personal reservations, Windu's experience on Hissrich reminded him of the Jedi Order's commitment to safeguarding the lives of others. With his newfound resolve, Windu affirmed his belief that the Order had a moral responsibility to defend the citizens of the Republic as well as all beings throughout the galaxy.[114]\nDuring the Clone Wars, the Jedi were victorious on battlefronts across the galaxy, including Christophsis,[67] Ryloth,[125] and Umbara.[166] In their capacity as leaders of the Grand Army of the Republic, the Jedi came to be seen as great warriors. Jedi Knight Anakin Skywalker, for example, was considered by some to be the greatest warrior of the Jedi Order.[49]\n\n     The Battle of Christophsis was an early victory for the Jedi-led forces of the Galactic Republic.  \nDuring the Battle of Christophsis, Clone Sergeant \"Slick\" was arrested as a spy for the Confederacy of Independent Systems. The sergeant claimed that he acted in the interests of the clones, whom he viewed as a slave army fighting for the Jedi and the Republic. However, the clone trooper officers who arrested him—Clone Commander CC-2224 \"Cody\" and Clone Captain CT-7567 \"Rex\"—questioned Slick's motives, noting how he betrayed the Republic for money and that his actions endangered clone lives. Although Slick succeeded in sabotaging much of the Republic's military equipment,[167] Jedi Generals Obi-Wan Kenobi and Anakin Skywalker successfully led their battalions, respectively the 212th Attack Battalion and the 501st Legion, to victory over the Separatists on the Christophsian homeworld.[67]\n\n     The Jedi's forces won the Battle of Ryloth with the support of the Twi'lek Resistance.  \nThe Battle of Ryloth was a coordinated effort by the Republic to liberate the Twi'leks' homeworld from Separatist occupation. With the Jedi in command, the clone troopers mainly relied on using blaster rifles and Electro Magnetic Pulse grenades to reduce the level of destruction on Ryloth. Whereas the Separatists used the Twi'leks as living shields to deter a direct Republic attack, the Jedi and their clones were careful to avoid causing civilian casualties.[168] During the final phase of the invasion, General Windu endeavored to take the capital city of Lessu with the support of the Twi'lek Resistance led by Cham Syndulla.[125] Setting aside his dislike for politics,[18] Windu used diplomacy to win the freedom fighter's help, convincing the rivals Syndulla and Senator Orn Free Taa to work together in common cause. The combined forces of Jedi, Republic, and Twi-leks captured the capital along with the Separatist Emir of Ryloth Wat Tambor.[125]\n\n     The Jedi successfully invaded Geonosis and destroyed the primary battle droid foundry.  \nThe Second Battle of Geonosis occurred after the Geonosian resistance ousted the Republic's occupation force from their world. With the Separatists in control of the Geonosian droid factories once more, the Jedi returned to Geonosis at the head of an invasion force, having deemed Geonosis crucial to their efforts at restoring order to the Republic. The attack was led by Jedi Generals Ki-Adi-Mundi, Obi-Wan Kenobi, Luminara Unduli, and Anakin Skywalker.[169] After the generals' forces converged at the Point Rain staging area, the primary droid foundry was destroyed by Jedi Commanders Barriss Offee and Ahsoka Tano.[170] The capture of Archduke Poggle the Lesser subsequently ended Separatist control of Geonosis,[171] thereby depriving the Confederacy military of further Geonosian support against the Republic.[172]\n\nRogue Jedi[]\n\n\"I did it because I've come to realize what many people in the Republic have come to realize, that the Jedi are the ones responsible for this war, that we've so lost our way that we have become villains in this conflict, that we are the ones that should be put on trial, all of us! And my attack on the Temple was an attack on what the Jedi have become, an army fighting for the dark side, fallen from the light that we once held so dear. This Republic is failing! It's only a matter of time.\"\n―Barriss Offee, admitting to the bombing of the Jedi Temple hangar[68]\nBy the time of the Alderaan Refugee Conference, Padmé Amidala stated that over one hundred Jedi had been killed in the war.[173] More Jedi were killed as the war continued; Jedi Master Even Piell died at the Battle of Lola Sayu;[174] during the assault on Vizsla Keep 09, Count Dooku killed Jedi Master Tiplee.[175] In addition to the casualties of war, the Jedi Order lost a few of its members to the dark side of the Force, such as Jedi Master Pong Krell[166] and Padawan Barriss Offee.[68]\n\n     Jedi General Pong Krell assumed command of the 501st Legion during the Battle of Umbara.  \nKrell served in the Clone Wars as a successful Jedi General whose record reflected numerous victories for the Grand Army of the Republic.[176] His command style resulted in high levels of clone trooper casualties; nevertheless, Krell was an acclaimed war hero by the time of the Battle of Umbara,[177] during which he temporarily assumed command of the 501st Legion after Anakin Skywalker returned to Coruscant at the behest of the Jedi High Council and Chancellor Palpatine.[178]\nThough originally a Republic loyalist world at the onset of the Clone Wars,[3] Umbara defected to the Separatists in the wake of Senator Mee Deechi's assassination. The Republic therefore invaded the Umbaran homeworld, precipitating the Battle of Umbara.[178] By then, Krell had foreseen the rise of a New Order in the aftermath of the Clone Wars. Convinced that the Jedi Order would be defeated, Krell secretly turned against both the Order and the Republic. He sought to prove his new loyalties to Count Dooku by undermining the Republic's efforts to retake Umbara. However, Krell's plans ended when the 501st mutinied against the general's command. Krell was taken into custody after killing multiple clones while resisting arrest. Ultimately, the fallen Jedi Master was executed by[166] one of his strongest supporters, CT-6922 \"Dogma,\"[179] after admitting his betrayal of the Republic.[166]\n\n     Barriss Offee was arrested for perpetrating of an attack on the Jedi Temple and conspiring to incriminate Ahsoka Tano.  \nBarriss Offee believed the Jedi had deviated from their course as peacekeepers and so arranged a bombing at the Jedi Temple, for which framed fellow Padawan Ahsoka Tano. Tano, in turn, left the Jedi Order unable to trust the Council after turning its back on her during her trial.[68] Eventually, the High Council came to be aware of Dooku's hand in the creation of the clone army, and of the lies and mistrust that surrounded them, both inside the Temple and the Senate.[180] Grand Master Yoda even foresaw that the Jedi would not win the Clone Wars,[131] just as public support for the Jedi weakened due to their management of the conflict.[80]\n\nThe last stand[]\n\n\"In the name of the Galactic Senate of the Republic, you're under arrest, Chancellor.\"\"Are you threatening me, Master Jedi?\"\"The Senate will decide your fate.\"\n―Mace Windu and Sheev Palpatine[17]\n     The High Council moved to arrest Supreme Chancellor Sheev Palpatine, revealed to be the Sith Lord Darth Sidious.  \nThe war would come to an end in 19 BBY[55] after Sidious betrayed and orchestrated Tyranus' death in the Battle of Coruscant in order to lure Skywalker to the dark side. The Jedi calculated a decisive Republic victory through the destruction of General Grievous, which was achieved by Obi-Wan Kenobi during the Battle of Utapau. However, Skywalker, whose turmoil clouded his judgment, learned that Palpatine was Sidious. Though he informed Windu of Palpatine's identity, Sidious resisted the Jedi's efforts to arrest him, killing three Jedi Masters—Kit Fisto, Agen Kolar, and Saesee Tiin—forcing Windu to duel the Dark Lord alone. Skywalker rushed to Palpatine's office as Windu and the chancellor fought, arriving moments after the Jedi champion disarmed the Sith Lord. Before Windu could kill Sidious, Skywalker betrayed him by severing his hand, which led to the Jedi Master's death. Believing Sidious had the power to save his secret wife, Padmé Amidala, Skywalker betrayed the Jedi and became Sidious' apprentice, and was given the name of Darth Vader.[17]\n\nThe purge[]\n Main article: Order 66\n Main article: Great Jedi Purge\n\n\"A young Jedi named Darth Vader, who was a pupil of mine until he turned to evil, helped the Empire hunt down and destroy the Jedi Knights. He betrayed and murdered your father. Now the Jedi are all but extinct.\"\n―Obi-Wan Kenobi, to Luke Skywalker[59]\n     Converted to the dark side, Anakin Skywalker led the Great Jedi Purge as the Sith Lord Darth Vader.  \nBranding Windu's actions as treason, Palpatine declared the Jedi to be enemies of the Republic and sent Vader to oversee the siege of the Jedi Temple. As his new apprentice purged the Temple of its inhabitants, including the younglings, Sidious authorized his Clone Commanders to execute Order 66, thereby activating the biochips that programmed the clones to see the Jedi as traitors to the Republic. As a result, thousands of Jedi throughout the galaxy were betrayed and executed by their clones including Ki-Adi-Mundi on Mygeeto, Aayla Secura on Felucia, Plo Koon on Cato Neimoidia, Stass Allie on Saleucami,[17] Depa Billaba on Kaller,[181] and Jaro Tapal above Bracca.[182]\nOut of an estimated number of ten-thousand Jedi,[82][81][183][184] just a few survived to see the proclamation of the New Order, marking the inception of the Galactic Empire and the rise of Palpatine as its Emperor.[17] Survivors included Yoda,[104] Obi-Wan Kenobi,[59] Ahsoka Tano,[185] Caleb Dume,[183] Cal Kestis, Cere Junda and her Padawan Trilla Suduri, Taron Malicos,[182] and at least initially, Uvell,[186] Luminara Unduli,[187] Oppo Rancisis, Eeth Koth, Coleman Kcaj,[188] Jocasta Nu,[12] Kirak Infil'a,[23] Selrahc Eluos, Ka-Moon Kholi, Zubain Ankonori, Khandra, Mususiel, Nuhj, Ferren Barr, and possibly Quinlan Vos.[12] During their self-imposed exile, Kenobi and Yoda, along with Senator Bail Organa, hid Vader's newborn children, the Force-sensitive twins Luke Skywalker and Leia Organa, from the Sith, hoping that in time they would become the key to the Jedi Order's future to stop the dark side.[131][17]\n\n     The Galactic Empire hunted the few remaining Jedi who survived the initial execution of Order 66.  \nWord about the supposed Jedi rebellion and the Order's destruction spread throughout the galactic population, and clone troopers were ordered to hunt down any Jedi survivors.[181] According to Imperial Admiral Rae Sloane, the Jedi that had survived Order 66 made a last stand against a clone trooper charge led personally by the future war veteran and Shadow Council member Hodnar Borrum, who was known to hold disdain for the Force, on a mountain fortress on either Madar or Morad.[189]\nIn addition to the Empire's suppression of all information relating to the Jedi, it was considered treasonous to be a Jedi or render assistance to a Jedi. Imperial laws also prohibited the use or study of the Force, resulting in the banning of educational studies concerning the Jedi. As a consequence, instructors who specialized in Jedi history lost their positions,[108] including Sava Korin Pers[190] and Sava Madelin Sun from the University of Bar'leth.[108] Within five years of the Order's destruction,[81] the Jedi were effectively erased from the collective consciousness in the galaxy due to the Great Jedi Purge,[108] which also involved the systematic destruction of their temples[82] and the unceasing, extensive hunts carried out by the Inquisitorius.[191]\nJedi survivors that were captured were taken to Mustafar for interrogation and execution,[192][185] as well as the Spire on Stygeon Prime, wherein the body of Luminara Unduli was preserved to lure out any surviving Jedi.[187] Among the last reservoirs of knowledge of the Order were Antron Bach's vault in an abandoned colony, created at Uvell's behest,[186] and Grakkus the Hutt's private collection on Nar Shaddaa.[35][193] Safeguarding holocrons, lightsabers, journals, archives, and other artifacts, they partially preserved the teachings of the fallen Order.[186][35] The surviving Jedi Nedriss Narr and Vanzell Mar-Klar attempted to train new younglings in a secret temple.[194]\n\nDark times[]\nFallen order[]\n Main article: Secret mission to rebuild the Jedi Order\n\n\"With that list of Force-sensitives… We could rebuild the Jedi Order and defeat the Empire.\"\n―Cere Junda, to Cal Kestis[182]\nFor nearly twenty years, the Empire was able to expand without opposition of a disbanded Jedi Order. A few of its former members, however, stayed true to their code of honor and continued to fight the Empire's injustice, albeit in different ways. Though former Padawan Ahsoka Tano had become disillusioned by the Council's actions and no longer identified as a Jedi, she came into contact with Bail Organa from Alderaan, with whom she worked to coordinate the efforts of a rebellion under the codename \"Fulcrum,\" fifteen years after the fall of the Republic.[185]\n\n     Having survived the execution of Order 66, Padawan Cal Kestis endeavored to resurrect the fallen Jedi Order.  \nFive years after the rise of the Empire and the destruction of the Jedi Order, there was an attempt to bring the Order back. Padawan Cal Kestis, who had been hiding on Bracca since Order 66, was recruited by the former Jedi Knight Cere Junda, who believed that the return of the Jedi Order was the best option to defeat the Empire. To accomplish this, they sought to recover a holocron that had been hidden on the planet Bogano by Jedi Master Eno Cordova. This holocron contained a list of the locations of Force-sensitive children across the galaxy.[182]\nAfter scouring ancient ruins for clues left behind by the extinct Zeffo civilization, Kestis succeeded in unlocking the Vault that contained the holocron, but the artifact was taken by the Second Sister, an Inquisitor who had been Junda's Padawan before the Purge. Junda proclaimed Kestis a Jedi Knight, and together they pursued the Second Sister to the Fortress Inquisitorius on the ocean moon Nur. They succeeded in retrieving the holocron from the Second Sister, who was executed by Darth Vader. The Dark Lord overpowered both Jedi, wounded Kestis for refusing to surrender the holocron, and goaded Junda to embrace the dark side. Ultimately, though, Kestis and Junda managed to escape from Vader with their allies' help. Despite Kestis' commitment to the restoration of the Jedi Order, the young Jedi Knight destroyed the holocron to protect the Force-sensitive younglings, entrusting their fate to the will of the Force.[182]\n\nRediscovery of an abandoned world[]\n\n\"Tanalorr's a fortress. We should use it for the Hidden Path. Gather allies. Train. They'd never see us coming.\"\n―Cal Kestis[34]\n     Hidden in the deadly Koboh Abyss nebula, Tanalorr was a world that was abandoned by the Jedi Order.  \nOver the five years following the holocron's destruction, Kestis has become an extremely important target for the Empire, having attracted the attention of not only the Inquisitorius, but the ISB as well. In 9 BBY, on the planet Koboh, Kestis encountered something from the Jedi's golden age. Kestis encountered the Jedi Dagan Gera, who has been preserved in bacta since the days of the High Republic. Kestis freed the old Jedi and asked for his help in his fight against the Empire. However, Gera fell out with the Jedi Order, who he believed had betrayed him because the Jedi had given up on Tanalorr, a hard-to-reach world Dagan had become obsessed with, after an attack by the Nihil. Gera fell to the dark side and bled the kyber crystal from his lightsaber, starting a duel with Kestis afterwards. Dagan escaped with the help of his old ally, the Gen'Dai Rayvis, and intended to return to Tanalorr and create an army led by Force users trained by himself to fight the Empire. However, due to the clouded view of Gera by the dark side, Kestis opposed his plan. Along with Bode Akuna, Kestis killed Dagan and obtained the compass that would guide them to Tanalorr, a place that Kestis intended to transform into a refuge for those persecuted by the Empire.[34]\n\n     Cere Junda's death left Jedi Cal Kestis determined to build something that would outlast the Empire.  \nHowever, the compass was stolen by Akuna, who was an ISB's spy and a survivor of the Jedi Purge. Akuna intended to flee to Tanalorr with he daughter so that they could live free from the Empire forever, which, in he opinion, Kestis' intentions for Tanalorr jeopardized. Kestis followed Akuna to Tanalorr, and along with he ally, the Nightsister Merrin, slew him. Kestis and his friends took in Bode's daughter and held a Jedi funeral for Akuna, Cere Junda, and Eno Cordova, who were trying to restore knowledge from the Jedi archives and were killed due to Akuna stealing the compass. With the compass in their possession, Kestis and his allies began to prepare Tanalorr for use in the Hidden Path's operations.[34]\n\nRebellion and war[]\n\n\"Things are getting worse, just as they did when I was your age. But back then, there were ten thousand Jedi protecting the galaxy. Now…\"\"There's just you and me.\"\n―Kanan Jarrus and Ezra Bridger[184]\n     The Jedi Kanan Jarrus and Ezra Bridger supported the early Rebellion against the Empire.  \nEight years after the end of the Clone Wars, Caleb Dume, who had assumed the identity of Kanan Jarrus, joined forces with the Twi'lek rebel fighter Hera Syndulla.[183] Together, the two established a small rebel cell based on the starship Ghost.[195] Fifteen years into the Imperial Era, a number of inaccurate tales about the Jedi started to appear. For example, the bounty hunter duo Gowski and Fiscal were under the impression that Jedi aged backward, were able to fly, and had unusually dense bones.[196] About five years before the Battle of Yavin, Jarrus took on a Force-sensitive teenager named Ezra Bridger as his apprentice.[195]\nJarrus' decision to ignite his lightsaber on Kessel drew the attention of the Grand Inquisitor, whom Vader had tasked with hunting down Jedi and recruiting the \"children of the Force.\"[195] Under Jarrus' tutelage, Bridger trained as a Jedi while evading the Grand Inquisitor and other Imperial agents.[197] Bridger completed his Jedi Trials at the Lothal Jedi Temple under the guidance of Master Yoda, who also counseled Jarrus to continue training Bridger.[82] At the instigation of Grand Moff Wilhuff Tarkin, the Grand Inquisitor and Agent Alexsandr Kallus concocted a trap that captured Jarrus. However, Bridger and the other rebels mounted a mission to rescue Jarrus and killed the Grand Inquisitor. In the process, they encountered other members of the rebellion including the former Padawan Ahsoka Tano, who had become a key rebel leader.[185]\n\nReturn of the Jedi[]\n\n\"You failed, your Highness. I am a Jedi, like my father before me.\"\n―Luke Skywalker, to Darth Sidious[48]\nDuring a mission, they inspired not only the people of Lothal to fight the Empire, but also the early \"Alliance\" to finally organize and to bring several Rebel cells together, paving the way for the Alliance to Restore the Republic.[185] An underground faith known as the Church of the Force emerged in support of the Jedi and their ideals, believing that only their return could restore balance to the Force.[132]\n\n     The galaxy found a new hope in Anakin Skywalker's son, Luke Skywalker, who became a Jedi like his father before him.  \nIn 0 BBY,[55] Obi-Wan Kenobi emerged from his exile on Tatooine, not only to help deliver the plans of the Death Star to the Rebel Alliance as requested by Rebel leader Princess Leia Organa but to begin training Luke Skywalker to become a Jedi Knight,[59] in the hopes that Skywalker would be able to defeat both Vader and the Emperor.[48] Through Skywalker, with Kenobi's guidance, the Rebel Alliance achieved a significant victory in the Battle of Yavin, which meant a turning point for the Alliance in the Galactic Civil War, though at the cost of Kenobi who sacrificed himself to save Skywalker.[59] In 3 ABY,[55] Skywalker received training from Yoda on Dagobah.[104] Hailed as \"the last of the Jedi,\" Skywalker was told by Yoda to pass on what he had learned so that the legacy of the Jedi Order could go on, before passing.[48]\nForced to duel Vader while Sidious watched during the Battle of Endor, Skywalker briefly gave into anger and cut off his father's hand. Satisfied, Sidious betrayed Vader by ordering Luke to take his place on Sidious' side, but Skywalker rejected his anger and proclaimed he would always remain a Jedi, which led to him being tortured by the furious Emperor. In agony, he begged his father to save him, convincing the former Anakin Skywalker to save his son, leading to the redeemed Jedi Knight to destroy his master. By destroying his master and the Sith,[48] Anakin brought balance to the Force for the time being,[198] ultimately fulfilling his role as the Chosen One. While the injuries he sustained in the process of destroying Sidious, led to his death shortly after, Anakin made peace with Luke before passing and becoming a Force ghost alongside Yoda and Obi-Wan,[48] who assured him that his son likely had a bright future ahead.[199]\nAfter the Battle of Jakku, the Empire officially surrendered to the New Republic by way of the Galactic Concordance, which put strict provisions on the rump state.[132] In the Unknown Regions, however, fleeing Imperial officers and nobles conspired to rebuild their armies and fleets, culminating in the rise of the hermetic First Order.[53] In the meantime, Skywalker gained a new ally in an individual named Lor San Tekka, a member of the Church of the Force during the dark times,[132] who believed the return of the Jedi was necessary to have balance in the Force[53] and aided Skywalker in retrieving lost Jedi lore.[200]\n\nAn order reborn[]\nStumbled Beginnings[]\n\n\"After the Empire fell and the Sith Lords were vanquished, I had great hope for the future of the Jedi. I came to believe that if a single Jedi could help bring balance back to the Force, then perhaps a restored Jedi Order could maintain that peace and prevent the dark side from ever regaining its hold on the galaxy.\"\n―Luke Skywalker[74]\n     As the last Jedi, Skywalker carried the mandate of restoring the Jedi Order.  \nFollowing the Battle of Endor, the Alliance General Han Solo and the former Princess of Alderaan, Leia Organa, were married[189] and after the defeat of the Empire at Jakku, they had a son named Ben Solo.[7] Ben was Luke Skywalker's nephew,[53] as Organa was his twin sister, a fact Skywalker only learned from the Force spirit of Obi-Wan Kenobi following Yoda's death.[48] Before her wedding, Skywalker had spoke to Organa about training her and affirmed that she did not need to give up her marriage to Solo if she went down the Jedi path. While at first she still feared she would nevertheless have to chose between her marriage or that path,[106] she would agree to become her brother's pupil. On Ajan Kloss, Skywalker trained Organa in the ways of the Jedi as his first student.[76] She even constructed her own lightsaber, but after seeing a vision of her son's death as the culmination of her Jedi training, Organa declined to progress further. She then directed her focus to the future of the New Republic.[198]\nAround five years after the Battle of Endor, Skywalker helped rescue Grogu, a mysterious child of the same species as Yoda, survivor of the siege of the Jedi Temple and who had performed great feats in the Force. Skywalker expressed his desire to train the child in the ways of the Force and took Grogu in with the approval of the child's protector, the Mandalorian Din Djarin.[201] With Ahsoka Tano helping to oversee the effort,[88] the Jedi Temple of Luke Skywalker was founded as a training center when Skywalker attempted to restore the Jedi Order,[16] with Grogu becoming Skywalker's first student. After Tano parted ways with them for the time being, Skywalker gave Grogu a choice; he could remain with his new Jedi Order or return to Din Djarin.[88] Grogu chose to return to Djarin, ending his Jedi training and having Skywalker send R2-D2 to pilot Grogu to Tatooine to reunite him with Djarin.[202]\n\nA new generation[]\n\n\"For many years, there was balance and then I saw Ben. My nephew with that mighty Skywalker blood. In my hubris, I thought I could train him; I could pass on my strengths. Han was Han about it, but… Leia trusted me with her son. I took him and a dozen students, and began a training temple.\"\n―Luke Skywalker, to Rey[16]\nAlthough Skywalker regarded Kenobi and Yoda as the greatest masters in Jedi history, he knew that his training was unorthodox. As a Jedi Master, Skywalker aimed to provide his apprentices with a more traditional approach to the Jedi arts, and as such, his Padawans followed a training regime similar to the one that existed during the Republic Era.[74] The New Jedi Order began as a class of Force-sensitive younglings, beginning with Skywalker's nephew, Ben Solo,[203] whom he agreed to train in the ways of the Force at his sister's behest. In many ways, Solo reminded his parents of his grandfather, Darth Vader, therefore Organa wanted him to train with his uncle in the hope that he would not turn to the dark side as well.[53]\n\n     Skywalker founded a temple where he could train a new generation of Jedi apprentices, including his nephew Ben Solo.  \nIn addition to Solo, Skywalker recruited several other students including Hennix, Tai, and Voe[204] during his visits to many worlds over two decades.[52] During this time, Solo was trained in lightsaber combat and became skilled with the Jedi weapon.[132] While Solo was still an adolescent, Skywalker traveled with his nephew and Lor San Tekka to the Jedi outpost on Elphrona seeking Jedi artifacts. The trio were accosted by a dark side sect known as the Knights of Ren. Master Skywalker used his Force powers to defeat the Knights. Before leaving, the Knights' leader Ren told Solo to contact the Knights should he ever consider exploring the dark side further.[39]\nBy 21 ABY,[205] the new Jedi Order had grown to the point where it already had senior pupils on top of a new class of younglings in training. Around this time, Luke Skywalker experienced visions that distracted him from some of his basic duties at the academy, leaving some of his senior students to take over for him on this duties. A Twi'lek woman named Enyo served as an instructor on lightsaber combat, running a class of younglings through a series of exercises with training blades. When Skywalker went on a mission with Lor San Tekka that distanced him from his temple, Ben Solo, who had also taken the duties of running training exercises on the younger students, stayed to oversee the academy.[89]\n\nThe temple's destruction[]\n\n\"I never… I didn't want this.\"\"And you did not choose it, Ben. The Jedi did. Skywalker.\"\n―Ben Solo and Snoke[204]\n     The confrontation between Skywalker and his nephew had fateful consequences for the New Jedi Order.  \nSolo's family would ultimately learn that he was gradually seduced to the ways of the dark side through the machinations of the First Order's ruler, Supreme Leader Snoke.[206] Organa blamed Snoke as the sole cause of her son's descent into darkness, culminating in the destruction of the Jedi Temple, but Skywalker felt responsible for his nephew's fate. Sensing the dark side's influence within Solo, Skywalker probed his nephew's mind and beheld visions of the dark warrior that he was becoming. Skywalker instinctively raised his lightsaber to kill his nephew while he slept, believing Solo would destroy all that he loved; however, he stopped himself from killing his sister's son, and was overcome by shame. He then saw that Solo had awoken. He saw fear in the eyes of his young nephew, and in that moment Skywalker felt he had failed as a Jedi Master.[16]\nSolo reached for his blade and razed the hut using the Force, collapsing it in on his uncle.[16] As Solo struggled to comprehend the situation and lost control of his emotions, the Jedi Temple was destroyed by a powerful storm, killing most of Skywalker's other students. Shortly later, Hennix, Tai, and Voe returned from an offworld trip. They confronted Ben Solo, who told them that Skywalker had tried to murder him. Skeptical, they tried to detain him but Solo fled following a brief skirmish and sought Snoke. Hennix, Tai, and Voe resolved to find Solo and investigate what had happened. Meanwhile, Solo sought out Snoke and the two decided to seek out the Knights of Ren.[204]\n\n     With his temple destroyed, Skywalker exiled himself to Ahch-To, vowing to never train another student.  \nSkywalker regained consciousness in the rubble of his nephew's hut too late to prevent Solo's destruction of the Jedi temple and the deaths of the students inside. Solo had already fled, and Skywalker could only witness his temple still burning alongside his astromech droid, R2-D2.[16] Skywalker felt responsible for the ordeal and decided to exile himself, although those closest to him learned that he was also searching for the first Jedi Temple. Skywalker only left traces of his location in a single star map, with the remaining data being present in old Imperial records. Skywalker eventually found the first Jedi temple on the aquatic world of Ahch-To, where he took up refuge and lived in exile as a hermit.[53] Skywalker vowed to never attempt another rebirth of the Jedi Order, and therefore resolved to die as the last Jedi.[16]\n\nThe Jedi Killer[]\n\n\"Now you will be who you are. Who you were always meant to be.\"\n―Darth Sidious, to Ben Solo[207]\n     Rejecting the Jedi and his family, Ben Solo adopted the identity of Kylo Ren.  \nTraveling to the Jedi outpost on Elphrona, Solo contacted Ren, who told him to find the Knights of Ren on Varnak. However, Hennix, Tai and Voe caught up with the fugitive Solo.[39] Though Tai preferred to reason with Solo, Voe and Hennix fought him, believing that he had a role in destroying the Jedi Temple and killing their brethren. Solo killed Hennix in self-defense before fleeing to Varnak. However, Ren was still unsatisfied that Solo was worthy to become a Knight of Ren but took him on a trial run.[203]\nTo test Solo's worthiness for the dark side, the Knights of Ren enlisted his services in obtaining a Force relic called the Mindsplinter from a group of Mimbanese on the Minemoon. Using Tai's connection to Solo, Tai and Voe tracked him down there. During the ensuing skirmish, Tai tried to reason with Solo but was murdered by Ren, who deemed him unworthy. Consumed by rage and grief, Solo killed Ren and Voe, embracing the dark side. Taking the path of darkness, Solo became the master of the Knights of Ren, adopting the name \"Kylo Ren\" and bleeding his kyber crystal.[207]\nSolo turned to the dark side of the Force and became an apprentice of Snoke, joining the First Order and the Knights of Ren in the process and taking on the new identity of Kylo Ren.[53] By the time of the outbreak of the First Order/Resistance War, Ren had gained a reputation of a \"Jedi killer\" due to Ren's skills with his lightsaber and his role in destroying Skywalker's new Jedi and his hopes of fully restoring the Jedi Order.[132] Ren was determined to live up to the legacy of his grandfather,[53] whom he considered to be Darth Vader[208] instead of Anakin Skywalker.[206]\n\nAn awakening[]\n\n\"If Skywalker returns, the new Jedi will rise.\"\n―Snoke[53]\nAs Luke Skywalker's efforts to rebuild the Jedi Order had seemingly failed,[132] the Jedi Master's fabled return became a symbol of hope for those who believed in him and the Jedi. For others, he remained a myth, but he also posed a threat for those who feared his reappearance, such as Supreme Leader Snoke and the First Order, who believed Skywalker's return would also mean the rise of the new Jedi. It was by this time that an awakening occurred within the Force. Snoke and Ren both sensed it;[53] Snoke was certain that as his apprentice grew stronger with the dark side, his counterpart in the light would rise as well. Convinced that it was Skywalker,[16] Snoke directed Ren to seek out and destroy his former master.[53]\n\n     Ren hunted Skywalker across the galaxy, searching for clues to the whereabouts of his old master.  \nWhile Skywalker's location was unknown to the galaxy at large, his old ally, Lor San Tekka, came into possession of a piece of a star map to the first Jedi Temple some thirty years after the Battle of Endor. When the Resistance, a splinter cell of the New Republic Defense Force led by General Leia Organa that opposed the First Order, learned of this, General Organa dispatched Poe Dameron to attempt to retrieve the map from San Tekka's residence on Jakku. The First Order, however, also seeking Skywalker in an effort to destroy the last of the Jedi, likewise learned of San Tekka's findings and attacked Jakku in an effort to retrieve it. An astromech droid named BB-8, with the map in tow, successfully escaped from Jakku with the aid of a Force-sensitive scavenger named Rey and a First Order stormtrooper deserter named Finn, who previously helped Dameron escape the First Order's custody. They met and traveled alongside Han Solo and his Wookiee partner, Chewbacca, in a journey to return BB-8 to the Resistance.[53]\n\n     During the search for Skywalker, Ren discovered Rey, a Force-sensitive scavenger with a mysterious past.  \nAfter a devastating attack against the New Republic's capital by the First Order's Starkiller Base, the Resistance sought to destroy the First Order superweapon. Once there, Han Solo attempted to turn his son back to the light, but he was killed by Ren instead, who was attempting to fully commit to Snoke and the dark side. Rey subsequently defeated Ren in a lightsaber duel and Starkiller Base was destroyed, after which the Resistance finally pieced together the map to Skywalker with help from R2-D2. Organa, relieved to finally find her brother, sought to bring him home. She sent Rey, along with Chewbacca and R2-D2, to Ahch-To, where the young girl found Skywalker among the refuge of the first Jedi temple.[53]\nThere, Rey presented the Jedi Master with his father's lightsaber—which he had lost on Cloud City decades prior—[104] as a symbol of the only hope the galaxy had left in defeating Kylo Ren, Snoke, the First Order and Knights of Ren by bringing about the return of the Jedi Order.[53]\n\nLast of the Jedi[]\n\n\"The rebellion is reborn today, the war is just beginning, and I will not be the last Jedi.\"\n―Luke Skywalker[16]\n     Rey sought out Skywalker, but the Jedi Master was unwilling to train her or help the Resistance.  \nRey was surprised to find that Luke Skywalker, the last Jedi, instead rejected her plea for help, tossing his father's lightsaber over his shoulder and confining himself within his hut near the first Jedi Temple. Undeterred, in part thanks to her past as a Jakku scavenger,[209] Rey followed Skywalker as he carried on his daily routine despite Skywalker telling her and Chewbacca that he would not face down the First Order. Skywalker was intrigued by Rey, however, when she felt voices calling her through the Force to an uneti tree containing the sacred Jedi texts. After sneaking aboard the Millennium Falcon and being shown a hologram of his sister's call for help to Jedi General Obi-Wan Kenobi decades earlier by R2-D2, however, Skywalker changed his mind and agreed to teach Rey the ways of the Jedi—and why, in his mind, it was time for the Jedi to end.[16]\n\n     The bond between Kylo Ren and Rey allowed them to communicate with each other through the Force.  \nMeanwhile, however, a Force-bond had opened up between Rey and Kylo Ren, something that Rey decided not to tell her new master. When Skywalker discovered this, he abruptly ended his training of Rey, telling her to leave. After a brief duel, Skywalker finally confessed to Rey the truth of the night his nephew destroyed his fledgling New Jedi Order. Rey, who had grown sympathetic to Ren's conflict over their shared feelings of abandonment, decided to leave Skywalker in an attempt to redeem Ren in the light side, as Skywalker had done to his father decades earlier.[16]\nRey traveled to the Supremacy, where Ren took her before his dark side master, Supreme Leader Snoke. Snoke proceeded to use the Force to tortuously probe Rey's mind, finding Skywalker's location. Snoke vowed to obliterate the last Jedi after dealing with the Resistance. Rey defied Snoke, trying to lash out at him; deeming her to have \"the spirit of a true Jedi,\" he commanded Ren to execute Rey. Instead, however, Ren used his grandfather's lightsaber to bisect the Supreme Leader. Ren and Rey then fought Snoke's Elite Praetorian Guard, defeating them. However, Ren did not turn back to the light side as Rey believed, rather he usurped his master, fully engrossed in the dark side. Ren offered Rey the chance to rule the galaxy by his side, but instead, the two fought over Skywalker's lightsaber, eventually breaking it in half using the Force, knocking both unconscious.[16]\n\n     Although Skywalker sacrificed himself for the Resistance, his death did not mark the end of the Jedi.  \nAfter regaining consciousness, Rey escaped the Supremacy, regrouping with Chewbacca and R2-D2 above the Millennium Falcon. They came to the aid of the Resistance during Ren's siege of Crait—as did Luke Skywalker. After reuniting with his sister Organa, Skywalker faced his nephew before the First Order Army. However, Skywalker was in fact projecting himself across the galaxy from Ahch-To, buying time for the Resistance's survivors to escape. By the time Ren realized this, it was too late; the remaining survivors of the Resistance, including Poe Dameron, Finn, and Leia Organa, had escaped aboard the Millennium Falcon with Chewbacca and Rey, who Skywalker acknowledged as a Jedi. Skywalker's projection disappeared and back at the first Jedi Temple, Skywalker, having exerted a great amount of energy, passed away, becoming one with the Force before the twin suns of Ahch-To. Rey, meanwhile, had recovered Skywalker's lightsaber and began working with the Resistance on the process of building a rebellion against the First Order, while Skywalker's heroic tale spread across the galaxy, inspiring others as the First Order rose to power.[16]\n\nReturn of the Sith[]\n\n\"I am all the Sith!\"\"And I… I'm all the Jedi.\"\n―Darth Sidious and Rey[198]\n     Darth Sidious returned after his first death to herald the rebirth of the Sith and the ultimate destruction of the Jedi Order.  \nIn the year following the Battle of Crait, Rey repaired the Skywalker lightsaber continued her Jedi training under Luke Skywalker's twin sister, Leia Organa, who had once briefly trained under her brother as a Jedi herself. Meanwhile, Kylo Ren and the First Order cracked down on any worlds that spread the tale of his defeat at the hands of Luke Skywalker. During that time, a cult of loyalists to the extinct Sith, the Sith Eternal, revealed themselves to the galaxy from the Unknown Regions by broadcasting the voice of the late Emperor Palpatine, the public identity of Darth Sidious, who was thought to be dead since the Battle of Endor. After obtaining a Sith wayfinder from Mustafar, Ren traveled to Exegol and found that Sidious still lived. The Emperor promised Ren the Sith Eternal's fleet of Xyston-class Star Destroyers, the Final Order, if he killed Rey, the last Jedi and the granddaughter of Sidious.[198]\nAfter traveling to Pasaana and Kijimi, Rey was confronted by Ren in the Death Star ruins on Kef Bir. Ren, having revealed to Rey her true lineage, attempted to turn her to the dark side. Their duel was interrupted when Ren sensed his mother's death across the galaxy, allowing Rey to wound the Supreme Leader while he was distracted. After healing Ren, Rey stole his TIE Whisperer and returned to the first Jedi Temple on Ahch-To to exile herself as her master had, afraid of her powers and her potential for the dark side as a descendant of Darth Sidious. The spirit of Luke Skywalker appeared before Rey to motivate and encourage her, teaching his student one last lesson: that confronting fear was the destiny of all Jedi. Skywalker gave Rey his sister's lightsaber and lifted his old starfighter out of the Ahch-To seas with the Force, allowing her to use Ren's wayfinder to travel to Exegol. Rey charted her path through hyperspace and transmitted the coordinates to the Resistance, allowing them to travel to Exegol as well.[198]\n\n     During the Battle of Exegol, Ben Solo and Rey stood together as Jedi against the Sith Emperor.  \nThe Battle of Exegol was fought between the Resistance and the Sith Eternal. It was during the battle that Rey confronted her grandfather Sidious, who offered her the Throne of the Sith and asked her to take her revenge for having her father and mother killed by sacrificing him as part of a ritual, allowing the Sith to reborn and ending the Jedi. However, a redeemed Ben Solo, who had renounced the dark side and shed his identity as Kylo Ren, arrived to help Rey. Solo defeated the Knights of Ren, but he and Rey were caught by the Dark Lord of the Sith, who learned that the two were a[198] prophesied[76] Force dyad. Sidious used their bond to heal himself, drawing on their combined life force to restore his body before tossing Solo into a nearby abyss to take his revenge on the Skywalker family for killing him years earlier at the Battle of Endor. The Sith Lord then unleashed his Force lightning on the Resistance and their Citizens' Fleet above. However, Rey was able to reach out to the past Jedi.[198] The Jedi Order was gone, but their strength remained.[4]\n\n     The Emperor was destroyed by his granddaughter Rey, who was strengthened by the spirits of the Jedi.  \nUpon hearing their voices call to her, Rey was strengthened and rose to face her grandfather. Palpatine redirected his Force lightning towards Rey, who defended herself with the lightsabers of her masters. As Sidious boasted that he was all the Sith, Rey responded that she was all the Jedi, and she deflected Sidious's lightning back towards him, causing the Sith Lord to disintegrate and be destroyed at last, preventing the rebirth of the Sith. A massive explosion burst out and erupted, causing the Sith Citadel beneath Exegol to collapse and crumble on the Sith Eternal cultists. Rey sacrificed herself to stop the Emperor, and Solo sacrificed his life in turn to resurrect Rey. With his death, the Skywalker bloodline became extinct.[198]\n\n     The destruction of the Sith marked a new era in galactic history, to be shaped by the Force in ways as yet unknown.  \nSome time later, Rey buried her mentor's lightsabers at the Lars moisture farm on Tatooine, the homeworld of the Skywalkers, and unsheathed her own lightsaber. When a local elderly woman stumbled upon Rey using her lightsaber, she asked the scavenger her name. Seeing the spirits of Luke and Leia in the distance, Rey responded that she was \"Rey Skywalker.\"[198]\nIn the aftermath of the First Order/Resistance War, the Jedi Order was still in the process of rebuilding itself. Rey eventually gained the status of Jedi Master while fighting to restore galactic peace, but the Order had not yet returned to its former glory.[18]\n\nLegacy[]\n\n\"Now that they're extinct, the Jedi are romanticized, deified. But if you strip away the myth and look at their deeds, the legacy of the Jedi is failure. Hypocrisy, hubris…\"\"That's not true.\"\"At the height of their powers, they allowed Darth Sidious to rise, create the Empire, and wipe them out. It was a Jedi Master who was responsible for the training and creation of Darth Vader.\"\"And a Jedi who saved him.\"\n―Luke Skywalker and Rey[16]\n     The Jedi Order was mythologized after its extinction, surviving in memory as a symbol of hope in the galaxy.  \nAfter the fall of the Empire, the Jedi Order's memory was rehabilitated and mythologized. The Jedi were romanticized during the New Republic Era, becoming deified symbols of a bygone era. Despite the Order's extinction, Supreme Leader Snoke endeavored to eradicate all traces of its past, believing that the Jedi inspired hope in the enemies of the First Order.[16]\nLuke Skywalker, a legendary Jedi Master, devoted years to rediscovering the Order's history which he chronicled in the book The Secrets of the Jedi. Although Skywalker held individual Jedi, such as Mace Windu or Qui-Gon Jinn, in high esteem,[74] he became disillusioned by the Order's actions toward the end of its history prior to the rise of the Empire. He faulted the Order for not thwarting the machinations of Darth Sidious, causing the extinction of the Jedi. Skywalker also believed that his old mentor, Obi-Wan Kenobi, was responsible for his father's transformation into Darth Vader. After his faith in the Jedi was restored by Rey and Yoda, Skywalker's final stand allowed the legend of the Jedi to spread once more, bringing hope to the galaxy as the First Order advanced.[16]\n\nBehind the scenes[]\nThe Jedi Order first appeared in the current canon in Star Wars: Episode I The Phantom Menace, though it previously appeared in various Star Wars Legends sources beforehand. The lore of the Jedi Order and of the Force was greatly expanded upon during the Star Wars: The Clone Wars television series. The role of the Jedi Order in preserving the peace of the Republic and later the controversy of them stepping into the role of military leaders is a pivotal plot point that eventually leads to the Order's downfall in Star Wars: Episode III Revenge of the Sith. Prior to that, they had been mentioned indirectly as the Jedi in the original trilogy as Luke Skywalker encounters Jedi Master Obi-Wan Kenobi and later Master Yoda. In Star Wars: Episode VI Return of the Jedi, Yoda charges Luke with carrying on the lessons and legacy of the Jedi Order.\nOn the subject of deific beliefs, the Jedi would be Nontheisic as they believe not in a deity but in a way of life that of following the Force and specifically it's Light Side neither of which are deities but an energy field and a way of channeling that energy respectively. Similarly, while the Chosen One is an important aspect of Jedi prophecy and mythology, the Chosen One is not a deity. Other ways the Jedi fall under the umbrella of nontheism is the order's focus on self-improvement, strict discipline over behaviour, strong selection for inwardly-focused virtures such as temperance, valuing non-aggression. Moreover when not supported of large and powerful groups by they more easily survive in isolated and hard to reach locations. Many of the religious groups which inspired the Jedi such as Buddhism, Taoism, are themselves nontheistic while nonetheistic traditions can also be found in Hinduism.\nThe Jedi Order originated in the rough draft of Star Wars as the Galactic Emperor's bodyguard.[210] They became affiliated with the Republica Galactica in the second draft.[210] Later, when composing background information for licensees in 1977, George Lucas described the Jedi Order as being \"several hundred thousand\" strong before the Purge.[211]\nFor the word \"Jedi,\" Lucas took inspiration from the Japanese term \"Jidaigeki,\" which refers to a drama set during the Edo period of Japanese history, when samurai were still in activity.[212]\nLuke Skywalker's new generation of Jedi was first mentioned in the 2015 film Star Wars: Episode VII The Force Awakens,[53] along with the film's novelization[206] and junior novelization.[213] Further background details about the Jedi and their massacre, which saw the end of Luke's students, can be found in the reference book Star Wars: The Force Awakens: The Visual Dictionary by Pablo Hidalgo.[132] On the contrary to what happened in the final films, George Lucas planned the Jedi Order to be restored by Luke Skywalker, who raised a new generation of Knights with the help of the surviving Jedi masters.[214]\n\nAppearances[]\n\nStar Wars: Force Arena\nStar Wars: Galactic Defense\n\"The Queen's Bloom\" — The High Republic: Tales of Light and Life\nThe High Republic: Convergence\nThe High Republic: Convergence audiobook\nThe High Republic: Quest for the Hidden City\nThe High Republic: Quest for the Hidden City audiobook\nThe High Republic: Path of Deceit\nThe High Republic: Path of Deceit audiobook\nThe High Republic Adventures: Quest of the Jedi\nThe High Republic — The Blade 1\nThe High Republic — The Blade 2\nThe High Republic — The Blade 3\nThe High Republic — The Blade 4\n \"Tales of Enlightenment: A Different Perspective\" — Star Wars Insider 215\nThe High Republic Adventures (2022) 1\nThe High Republic Adventures (2022) 2\nThe High Republic Adventures (2022) 3\nThe High Republic Adventures (2022) 4\nThe High Republic: The Battle of Jedha\nThe High Republic: The Battle of Jedha script\n \"Tales of Enlightenment: The Unusual Suspect\" — Star Wars Insider 216 (Mentioned only)\n\"Peace and Unity\" — The High Republic (2022) 1\nThe High Republic (2022) 1\nThe High Republic (2022) 2\nThe High Republic (2022) 3\nThe High Republic (2022) 4\n \"Tales of Enlightenment: No Such Thing as a Bad Customer\" — Star Wars Insider 217–218\nThe High Republic (2022) 5\nThe High Republic Adventures (2022) 5\nThe High Republic Adventures (2022) 6\nThe High Republic Adventures (2022) 7\nThe High Republic Adventures (2022) 8\nThe High Republic (2022) 6\nThe High Republic (2022) 7\nThe High Republic (2022) 8\nThe High Republic (2022) 9\nThe High Republic: Path of Vengeance\nThe High Republic: Path of Vengeance audiobook\nThe High Republic (2022) 10\nThe High Republic: Cataclysm\nThe High Republic: Cataclysm audiobook\nThe High Republic: Quest for Planet X\nThe High Republic: Quest for Planet X audiobook\n \"Tales of Enlightenment: Last Orders\" — Star Wars Insider 219\n\"A Closed Fist Has No Claws\" — The High Republic: Tales of Light and Life (In flashback(s))\n\"First Mission\" — The High Republic Adventures Annual 2021\n\"What a Jedi Makes\" — Stories of Jedi and Sith\n\"What a Jedi Makes\" — Stories of Jedi and Sith audiobook\n\"Set For Life\" — The High Republic Adventures Annual 2021\nYoung Jedi Adventures: The Young Jedi\nYoung Jedi Adventures: Yoda's Mission\n Star Wars: Young Jedi Adventures — \"Meet the Young Jedi\"\n Star Wars: Young Jedi Adventures — \"Lys' Creature Caper\"\n Star Wars: Young Jedi Adventures — \"Nubs and the Flower Fiasco\"\n Star Wars: Young Jedi Adventures — \"Nash's Firehawk Frenzy\"\n Star Wars: Young Jedi Adventures — \"Taborr's Pirate Showdown\"\n Star Wars: Young Jedi Adventures — \"Kai's Daring Droid Rescue\"\nYoung Jedi Adventures: Get Well, Nubs!\nYoung Jedi Adventures: Lys and the Snowy Mountain Rescue\nYoung Jedi Adventures: Jedi Training\nStar Wars: Young Jedi Adventures: Galactic Training\nYoung Jedi Adventures: My First Comic Reader Level 1\nThe High Republic: Into the Dark\nThe High Republic: Into the Dark audiobook\nThe High Republic: Light of the Jedi\nThe High Republic: Light of the Jedi audiobook\nThe High Republic: The Great Jedi Rescue\n \"Starlight: Go Together\" — Star Wars Insider 199–200\n \"Tales of Villainy: The Gaze Electric\" — Star Wars Adventures (2020) 6 (Indirect mention only)\nThe High Republic Adventures (2021) 1\nThe High Republic Adventures (2021) 2\nThe High Republic: The Edge of Balance, Vol. 1\nThe High Republic: A Test of Courage\nThe High Republic: A Test of Courage audiobook\nThe High Republic (2021) 1\nThe High Republic Adventures (2021) 3\nThe High Republic Adventures (2021) 4\nThe High Republic Adventures (2021) 5\n \"Starlight: First Duty\" — Star Wars Insider 201–202\nThe High Republic (2021) 2\nThe High Republic (2021) 3\nThe High Republic (2021) 4\nThe High Republic (2021) 5\n\"A Coruscant Solstice\" — Life Day Treasury\nThe High Republic Adventures (2021) 6\nThe High Republic Adventures (2021) 7\n \"Starlight: Hidden Danger\" — Star Wars Insider 203–204\nThe High Republic (2021) 6\nThe High Republic Adventures — The Monster of Temple Peak 2 (In flashback(s))\nThe High Republic Adventures — The Monster of Temple Peak 3 (In flashback(s))\nThe High Republic Adventures — The Monster of Temple Peak 4 (In flashback(s))\nThe High Republic: The Rising Storm\nThe High Republic: The Rising Storm audiobook\nThe High Republic (2021) 7\nThe High Republic: Race to Crashpoint Tower\nThe High Republic: Race to Crashpoint Tower audiobook\nThe High Republic: Showdown at the Fair\nThe High Republic Adventures Free Comic Book Day 2021\nThe High Republic (2021) 8\nThe High Republic: Trail of Shadows 1\n\"Deck the Halls\" — Life Day 1\nThe High Republic Adventures (2021) 8\nThe High Republic Adventures (2021) 9\nThe High Republic Adventures (2021) 10\nThe High Republic: The Edge of Balance, Vol. 2\nThe High Republic: Out of the Shadows\nThe High Republic: Out of the Shadows audiobook\n \"Starlight: Past Mistakes\" — Star Wars Insider 205–206\nThe High Republic: Tempest Runner (In flashback(s))\nThe High Republic: Trail of Shadows 2\nThe High Republic (2021) 9\nThe High Republic (2021) 10\nThe High Republic (2021) 11\n\"The Haul\" — The High Republic Adventures Annual 2021\nThe High Republic Adventures: Galactic Bake-Off Spectacular\nThe High Republic: Trail of Shadows 3\nThe High Republic Adventures (2021) 11\n \"Tales of Villainy: A Very Nihil Interlude\" — Star Wars Adventures (2020) 14 (Indirect mention only)\nThe High Republic: Mission to Disaster\nThe High Republic: Mission to Disaster audiobook\n \"Starlight: Shadows Remain\" — Star Wars Insider 207–208\nThe High Republic: Midnight Horizon\nThe High Republic: Midnight Horizon audiobook\nThe High Republic Adventures (2021) 12\nThe High Republic: The Battle for Starlight\nThe High Republic: The Fallen Star\nThe High Republic: The Fallen Star audiobook\nThe High Republic (2021) 12\nThe High Republic (2021) 13\nThe High Republic (2021) 14\nThe High Republic Adventures (2021) 13\nThe High Republic: Trail of Shadows 4\nThe High Republic (2021) 15\nThe High Republic Adventures Free Comic Book Day 2023\nThe High Republic: Trail of Shadows 5\nThe High Republic: Eye of the Storm 1 (In flashback(s))\nThe High Republic: Eye of the Storm 2\nThe High Republic: The Edge of Balance: Precedent (In flashback(s))\nThe High Republic Adventures: The Nameless Terror 1 (In flashback(s))\nThe High Republic Adventures: The Nameless Terror 2 (In flashback(s))\nThe High Republic Adventures: The Nameless Terror 3 (In flashback(s))\nThe High Republic Adventures: The Nameless Terror 4 (In flashback(s))\nThe High Republic (2023) 1\nThe High Republic Adventures (2023) 1\nThe High Republic Adventures (2023) 2\nStar Wars Eclipse\nThe Vow of Silver Dawn\n Star Wars: Tales of the Jedi — \"Justice\"\n Star Wars: Tales of the Jedi — \"Choices\"\n\"Resolve\" — Stories of Jedi and Sith\n\"Resolve\" — Stories of Jedi and Sith audiobook\nPadawan\nPadawan audiobook\n \"Life Day\" — Star Wars Adventures (2020) 3\n \"Life Day Part 2\" — Star Wars Adventures (2020) 4\nMaster & Apprentice\nMaster & Apprentice audiobook\nStar Wars (2015) 26\nStar Wars (2015) 27\nStar Wars (2015) 28\nStar Wars (2015) 29\nStar Wars (2015) 30\nAge of Republic - Qui-Gon Jinn 1\n\"The Weapon\" — Age of Republic Special 1\nDarth Maul (2017) 1\nDarth Maul (2017) 2\nDarth Maul (2017) 3\nDarth Maul (2017) 4\nDarth Maul (2017) 5\nAge of Republic - Darth Maul 1 (In flashback(s))\nQueen's Peril\nQueen's Peril audiobook\nStar Wars: Episode I The Phantom Menace\nThe Phantom Menace Read-Along Storybook and CD\nStar Wars Journeys: The Phantom Menace\n†  The Prequel Trilogy Stories\nStar Wars Journeys: Beginnings\n†  5-Minute Star Wars Stories (2015)\n5-Minute Star Wars Stories audiobook\n†  5-Minute Star Wars Villain Stories\nStar Wars Battlefront II\n Star Wars: Tales of the Jedi — \"The Sith Lord\"\nAge of Republic - Obi-Wan Kenobi 1\nObi-Wan and Anakin 1\nObi-Wan and Anakin 2\nObi-Wan and Anakin 3\nObi-Wan and Anakin 4\nObi-Wan and Anakin 5\nQueen's Shadow\nQueen's Shadow audiobook\n\"The Lesson (Obi-Wan & Anakin)\" — Star Wars (2020) 25\nAge of Republic - Count Dooku 1\nChoose Your Destiny: An Obi-Wan & Anakin Adventure\nDooku: Jedi Lost (Voice only)\nDooku: Jedi Lost script (Voice only)\n Star Wars: Jedi Temple Challenge — \"Episode 1\" (In flashback(s))\n Star Wars: Jedi Temple Challenge — \"Episode 6\" (In flashback(s))\n Star Wars: Jedi Temple Challenge — \"Episode 8\" (In flashback(s))\n \"Galactic Tales: Inheritance\" — Star Wars Insider 211 (Appears in hologram)\nInquisitor: Rise of the Red Blade\nInquisitor: Rise of the Red Blade audiobook\nStar Wars: Episode II Attack of the Clones\n Star Wars Galaxy of Adventures — \"Yoda vs Count Dooku – Size Matters Not\"\nQueen's Hope\nQueen's Hope audiobook\nJedi of the Republic – Mace Windu 1\nJedi of the Republic – Mace Windu 2\nJedi of the Republic – Mace Windu 3\nJedi of the Republic – Mace Windu 4\nJedi of the Republic – Mace Windu 5\nStar Wars: My First Comic Journey to Danger!\nBrotherhood\nBrotherhood audiobook\nHyperspace Stories 1\nHyperspace Stories 5\n\"501 Plus One\" — Age of Republic Special 1\nStar Wars Adventures: The Clone Wars – Battle Tales 1\nStar Wars Adventures: The Clone Wars – Battle Tales 2\nStar Wars Adventures: The Clone Wars – Battle Tales 3 (In flashback(s))\nStar Wars Adventures: The Clone Wars – Battle Tales 5\nAge of Republic - Anakin Skywalker 1\n\"The Eye of the Beholder\" — Stories of Jedi and Sith\n\"The Eye of the Beholder\" — Stories of Jedi and Sith audiobook\n \"Galactic Tales: Saber Truth\" — Star Wars Insider 210\n \"Galactic Tales: From The Shadows Come The Kran\" — Star Wars Insider 212\n Star Wars: The Clone Wars — \"Cat and Mouse\"\n Star Wars: The Clone Wars — \"The Hidden Enemy\"\nStar Wars: The Clone Wars film\n Star Wars: The Clone Wars — \"Clone Cadets\"\n Star Wars: Tales of the Jedi — \"Practice Makes Perfect\"\n Star Wars: The Clone Wars — \"Supply Lines\"\n Star Wars: The Clone Wars — \"Ambush\"\n\"Sharing the Same Face\" — The Clone Wars: Stories of Light and Dark\n\"Sharing the Same Face\" — The Clone Wars: Stories of Light and Dark audiobook\n Star Wars: The Clone Wars — \"Rising Malevolence\"\n Star Wars: The Clone Wars — \"Shadow of Malevolence\"\n Star Wars: The Clone Wars — \"Destroy Malevolence\"\n Star Wars: The Clone Wars — \"Rookies\"\n Star Wars: The Clone Wars — \"Downfall of a Droid\"\n Star Wars: The Clone Wars — \"Duel of the Droids\"\n Star Wars: The Clone Wars — \"Bombad Jedi\" (In flashback(s))\n Star Wars: The Clone Wars — \"Cloak of Darkness\"\n Star Wars: The Clone Wars — \"Lair of Grievous\"\n Star Wars: The Clone Wars — \"Dooku Captured\"\n Star Wars: The Clone Wars — \"The Gungan General\"\n\"Dooku Captured\" — The Clone Wars: Stories of Light and Dark (Mentioned only)\n\"Dooku Captured\" — The Clone Wars: Stories of Light and Dark audiobook (Mentioned only)\nChoose Your Destiny: A Clone Trooper Mission\n \"Separation Anxiety Part One\" — Star Wars Adventures (2020) 9\n \"Separation Anxiety, Part Two\" — Star Wars Adventures (2020) 10\n Star Wars: The Clone Wars — \"Jedi Crash\"\n Star Wars: The Clone Wars — \"Defenders of Peace\"\n Star Wars: The Clone Wars — \"Trespass\"\n Star Wars: The Clone Wars — \"Blue Shadow Virus\"\n Star Wars: The Clone Wars — \"Mystery of a Thousand Moons\"\n Star Wars: The Clone Wars — \"Storm Over Ryloth\"\n Star Wars: The Clone Wars — \"Innocents of Ryloth\"\n Star Wars: The Clone Wars — \"Liberty on Ryloth\"\n Star Wars: The Clone Wars — \"Holocron Heist\"\n Star Wars: The Clone Wars — \"Cargo of Doom\"\n Star Wars: The Clone Wars — \"Children of the Force\"\n Star Wars: The Clone Wars — \"Bounty Hunters\"\n Star Wars: The Clone Wars — \"The Zillo Beast\"\n Star Wars: The Clone Wars — \"The Zillo Beast Strikes Back\"\n Star Wars: The Clone Wars — \"Senate Spy\"\n\"A Jedi's Duty\" — Stories of Jedi and Sith\n\"A Jedi's Duty\" — Stories of Jedi and Sith audiobook\n Star Wars: The Clone Wars — \"Landing at Point Rain\"\n Star Wars: The Clone Wars — \"Weapons Factory\"\n Star Wars: The Clone Wars — \"Legacy of Terror\"\n Star Wars: The Clone Wars — \"Brain Invaders\"\n\"Worthless\" — Stories of Jedi and Sith\n\"Worthless\" — Stories of Jedi and Sith audiobook\n Star Wars: The Clone Wars — \"Grievous Intrigue\"\n Star Wars: The Clone Wars — \"The Deserter\"\n Star Wars: The Clone Wars — \"Lightsaber Lost\"\n Star Wars: The Clone Wars — \"The Mandalore Plot\"\n Star Wars: The Clone Wars — \"Voyage of Temptation\"\n Star Wars: The Clone Wars — \"Duchess of Mandalore\"\nCatalyst: A Rogue One Novel (Mentioned only)\nCatalyst: A Rogue One Novel audiobook (Mentioned only)\n Star Wars: The Clone Wars — \"Death Trap\"\n Star Wars: The Clone Wars — \"R2 Come Home\"\n Star Wars: The Clone Wars — \"Lethal Trackdown\"\n Star Wars: The Clone Wars — \"Corruption\" (In flashback(s))\n Star Wars: The Clone Wars — \"The Academy\"\n Star Wars: The Clone Wars — \"Assassin\"\n Star Wars: The Clone Wars — \"ARC Troopers\"\n Star Wars: The Clone Wars — \"Sphere of Influence\"\n Star Wars: The Clone Wars — \"Evil Plans\"\n Star Wars: The Clone Wars — \"Hostage Crisis\"\n\"Hostage Crisis\" — The Clone Wars: Stories of Light and Dark\n\"Hostage Crisis\" — The Clone Wars: Stories of Light and Dark audiobook\n \"Intermission, Part I\" — Star Wars Adventures (2017) 12\n \"Intermission, Part II\" — Star Wars Adventures (2017) 13\n \"Tales of Villainy: Give & Take\" — Star Wars Adventures (2020) 12\n Star Wars: The Clone Wars — \"Hunt for Ziro\"\n Star Wars Forces of Destiny — \"Teach You, I Will\"\n Star Wars Forces of Destiny — \"Unexpected Company\"\n Star Wars Forces of Destiny — \"The Imposter Inside\"\nForces of Destiny: Daring Adventures: Volume 1\nStar Wars: Forces of Destiny—Ahsoka & Padmé\n \"The Incident, Part 1\" — Star Wars Adventures (2020) 5\n \"The Incident, Part 2\" — Star Wars Adventures (2020) 6\n Star Wars Forces of Destiny — \"The Starfighter Stunt\"\n Star Wars Forces of Destiny — \"The Padawan Path\"\nForces of Destiny: Daring Adventures: Volume 2\n Star Wars: The Clone Wars — \"Heroes on Both Sides\"\n\"Pursuit of Peace\" — The Clone Wars: Stories of Light and Dark\n\"Pursuit of Peace\" — The Clone Wars: Stories of Light and Dark audiobook\n Star Wars: The Clone Wars — \"Senate Murders\"\n Star Wars: The Clone Wars — \"Nightsisters\"\n Star Wars: The Clone Wars — \"Monster\"\n Star Wars: The Clone Wars — \"Witches of the Mist\"\n Star Wars: The Clone Wars — \"Overlords\"\n Star Wars: The Clone Wars — \"Altar of Mortis\"\n Star Wars: The Clone Wars — \"Ghosts of Mortis\"\n Star Wars: The Clone Wars — \"The Citadel\"\n Star Wars: The Clone Wars — \"Counterattack\"\n Star Wars: The Clone Wars — \"Citadel Rescue\"\n Star Wars: The Clone Wars — \"Padawan Lost\"\n Star Wars: The Clone Wars — \"Wookiee Hunt\"\n Star Wars: The Clone Wars — \"Water War\"\n Star Wars: The Clone Wars — \"Gungan Attack\"\n Star Wars: The Clone Wars — \"Prisoners\"\n\"Ghosts of the Machine\" — Tales from the Rancor Pit\n Star Wars: The Clone Wars — \"Shadow Warrior\"\n Star Wars: The Clone Wars — \"Mercy Mission\" (Appears in hologram)\n Star Wars: The Clone Wars — \"Nomad Droids\"\n Star Wars: The Clone Wars — \"Darkness on Umbara\"\n Star Wars: The Clone Wars — \"The General\"\n Star Wars: The Clone Wars — \"Plan of Dissent\"\n Star Wars: The Clone Wars — \"Carnage of Krell\"\n\"The Shadow of Umbara\" — The Clone Wars: Stories of Light and Dark\n\"The Shadow of Umbara\" — The Clone Wars: Stories of Light and Dark audiobook\n \"Roger Roger\" — Star Wars Adventures (2017) 19\n \"Hide and Seek\" — Star Wars Adventures (2017) 20\nAge of Republic - General Grievous 1\n Star Wars: The Clone Wars — \"Kidnapped\"\n Star Wars: The Clone Wars — \"Slaves of the Republic\"\n Star Wars: The Clone Wars — \"Escape from Kadavo\"\n Star Wars: The Clone Wars — \"A Friend in Need\"\n Star Wars: The Clone Wars — \"Deception\"\n Star Wars: The Clone Wars — \"Friends and Enemies\"\n Star Wars: The Clone Wars — \"The Box\"\n Star Wars: The Clone Wars — \"Crisis on Naboo\"\n\"Bane's Story\" — The Clone Wars: Stories of Light and Dark (Indirect mention only)\n\"Bane's Story\" — The Clone Wars: Stories of Light and Dark audiobook (Indirect mention only)\n Star Wars: The Clone Wars — \"Brothers\"\n Star Wars: The Clone Wars — \"Revenge\"\n\"Dark Vengeance: The True Story of Darth Maul and His Revenge Against the Jedi Known as Obi-Wan Kenobi\" — The Clone Wars: Stories of Light and Dark\n\"Dark Vengeance: The True Story of Darth Maul and His Revenge Against the Jedi Known as Obi-Wan Kenobi\" — The Clone Wars: Stories of Light and Dark audiobook\n Star Wars: The Clone Wars — \"A War on Two Fronts\"\n Star Wars: The Clone Wars — \"Front Runners\"\n Star Wars: The Clone Wars — \"The Soft War\"\n Star Wars: The Clone Wars — \"Tipping Points\"\n Star Wars: The Clone Wars — \"The Gathering\"\n Star Wars: The Clone Wars — \"A Test of Strength\"\n Star Wars: The Clone Wars — \"Bound for Rescue\"\n Star Wars: The Clone Wars — \"A Necessary Bond\"\n\"Almost a Jedi\" — The Clone Wars: Stories of Light and Dark\n\"Almost a Jedi\" — The Clone Wars: Stories of Light and Dark audiobook\n Star Wars: The Clone Wars — \"Secret Weapons\"\n Star Wars: The Clone Wars — \"A Sunny Day in the Void\" (In flashback(s))\n Star Wars: The Clone Wars — \"Point of No Return\"\n Star Wars: The Clone Wars — \"Revival\"\n Star Wars: The Clone Wars — \"Eminence\" (Indirect mention only)\n Star Wars: The Clone Wars — \"Shades of Reason\" (Indirect mention only)\n Star Wars: The Clone Wars — \"The Lawless\"\n\"Kenobi's Shadow\" — The Clone Wars: Stories of Light and Dark\n\"Kenobi's Shadow\" — The Clone Wars: Stories of Light and Dark audiobook\n Star Wars: The Clone Wars — \"Sabotage\"\n Star Wars: The Clone Wars — \"The Jedi Who Knew Too Much\"\n\"Sisters\" — Age of Republic Special 1 (Appears on screen)\n Star Wars: The Clone Wars — \"To Catch a Jedi\"\n Star Wars: The Clone Wars — \"The Wrong Jedi\"\nThrawn Ascendancy: Chaos Rising (Voice only)\nThrawn Ascendancy: Chaos Rising audiobook (Voice only)\n Star Wars: The Clone Wars — \"The Unknown\"\n Star Wars: The Clone Wars — \"Conspiracy\"\n Star Wars: The Clone Wars — \"Fugitive\"\n Star Wars: The Clone Wars — \"Orders\"\n Star Wars: The Clone Wars — \"An Old Friend\"\n Star Wars: The Clone Wars — \"The Rise of Clovis\"\n Star Wars: The Clone Wars — \"Crisis at the Heart\"\n Star Wars: The Clone Wars — \"The Disappeared, Part I\"\n Star Wars: The Clone Wars — \"The Disappeared, Part II\"\n Star Wars: The Clone Wars — \"The Lost One\"\n \"Kindred Spirits\" — Star Wars Insider 159 (Mentioned only)\n Star Wars: The Clone Wars — \"Voices\"\n Star Wars: The Clone Wars — \"Destiny\"\n Star Wars: The Clone Wars — \"Sacrifice\"\n Star Wars: The Clone Wars — \"A Death on Utapau\"\n Star Wars: The Clone Wars — \"In Search of the Crystal\"\n Star Wars: The Clone Wars — \"Crystal Crisis\"\n Star Wars: The Clone Wars — \"The Big Bang\"\nDark Disciple\nDark Disciple audiobook\nDarth Maul—Son of Dathomir 1 (Mentioned only)\nDarth Maul—Son of Dathomir 3\nDarth Maul—Son of Dathomir 4 (Mentioned only)\nAge of Republic - Padmé Amidala 1\n Star Wars: The Clone Wars — \"Gone with a Trace\" (In flashback(s))\n Star Wars: The Clone Wars — \"Deal No Deal\"\n Star Wars: The Clone Wars — \"Together Again\" (Mentioned only)\n Star Wars: The Clone Wars — \"The Bad Batch\"\nThe Clone Wars: Season 7: Volume 1\n Star Wars: The Clone Wars — \"A Distant Echo\"\n Star Wars: The Clone Wars — \"On the Wings of Keeradaks\"\n Star Wars: The Clone Wars — \"Unfinished Business\"\n Star Wars: The Clone Wars — \"Old Friends Not Forgotten\"\nStar Wars: Episode III Revenge of the Sith\n Star Wars: The Clone Wars — \"The Phantom Apprentice\" (Appears in hologram)\n Star Wars: The Clone Wars — \"Shattered\" (Appears in hologram)\n Star Wars: The Bad Batch — \"Aftermath\"\nKanan 2\nKanan 3 (Mentioned only)\nDarth Vader (2017) 1 (Indirect mention only)\nDarth Vader (2017) 2 (Mentioned only)\nDarth Vader (2017) 3 (Mentioned only)\nDarth Vader (2017) 4 (Mentioned only)\nDarth Vader (2017) 6 (Mentioned only)\nDarth Vader (2017) 7 (Emblem only)\n Star Wars: The Bad Batch — \"Rampage\" (Indirect mention only)\nDarth Vader (2017) 8 (Emblem only)\nDarth Vader (2017) 9 (Emblem only)\nDarth Vader (2017) 10 (Emblem only)\nDarth Vader (2017) 11 (Mentioned only; in the opening crawl)\nDarth Vader (2017) 12 (Mentioned only; in the opening crawl)\n Star Wars: The Bad Batch — \"Battle Scars\" (Indirect mention only)\nKanan 4 (Mentioned only)\nDarth Vader (2017) 13 (Mentioned only; in the opening crawl)\nDarth Vader (2017) 14 (Appears in hologram)\nDarth Vader (2017) 16 (In flashback(s))\nDarth Vader (2017) 17 (Emblem only) (In flashback(s))\nDarth Vader Annual 2 (Vision to Darth Vader)\nAhsoka (In flashback(s))\nAhsoka audiobook (In flashback(s))\nAdventures in Wild Space: The Escape (Mentioned only)\nAdventures in Wild Space: The Snare (Mentioned only)\nAdventures in Wild Space: The Nest (Mentioned only)\nAdventures in Wild Space: The Dark (Mentioned only)\nAdventures in Wild Space: The Rescue (Mentioned only)\n \"So Much More\" — Star Wars Adventures Annual 2019 (Appears through imagination)\nThrawn (Indirect mention only)\nThrawn audiobook (Indirect mention only)\nThrawn 1 (In flashback(s))\n \"Orientation\" — Star Wars Insider 157 (Mentioned only)\nLords of the Sith (Indirect mention only)\nLords of the Sith audiobook (Indirect mention only)\nTarkin (Mentioned only)\nTarkin audiobook (Mentioned only)\nDarth Vader (2017) 18 (Mentioned only; in the opening crawl)\nStar Wars Jedi: Fallen Order (In flashback(s))\nJedi Fallen Order - Dark Temple 1 (In flashback(s))\nJedi Fallen Order - Dark Temple 2 (In flashback(s))\nJedi Fallen Order - Dark Temple 3 (In flashback(s))\nJedi Fallen Order - Dark Temple 4 (In flashback(s))\nJedi Fallen Order - Dark Temple 5 (In flashback(s))\nRebel Rising (Mentioned only)\nRebel Rising audiobook (Mentioned only)\nDarth Vader (2017) 25 (Vision to Darth Vader)\nJedi: Battle Scars (Mentioned only)\nJedi: Battle Scars audiobook (Mentioned only)\nA New Dawn\nA New Dawn audiobook\n Star Wars Galaxy of Adventures — \"Han Solo - From Smuggler to General\"\n\"The Ghosts of Maul\" — Stories of Jedi and Sith (Vision to Maul)\n\"The Ghosts of Maul\" — Stories of Jedi and Sith audiobook (Vision to Maul)\n \"The End of History\" — Star Wars Insider 154 (Mentioned only)\n Obi-Wan Kenobi — \"Part I\" (In flashback(s))\n Obi-Wan Kenobi — \"Part III\" (Indirect mention only)\n Obi-Wan Kenobi — \"Part V\" (In flashback(s))\n Obi-Wan Kenobi — \"Part VI\" (In flashback(s))\nStar Wars Jedi: Survivor (In flashback(s))\nStar Wars (2015) 7 (Mentioned only)\nHan Solo & Chewbacca 5 (Variant cover only)\nStar Wars Rebels webcomic (In flashback(s))\nStar Wars Rebels: Spark of Rebellion (Mentioned only)\nThe Rebellion Begins (Mentioned only)\nEzra's Wookiee Rescue (Mentioned only)\nThe Secret Jedi: The Adventures of Kanan Jarrus: Rebel Leader\nThe Inquisitor's Trap\nKanan 1\nKanan 7\nKanan 8\nKanan 9\nKanan 10\nKanan 11\nKanan 12 (Mentioned only; in the opening crawl)\nKanan's Jedi Training\n Star Wars Rebels — \"Call to Action\" (Indirect mention only)\n Star Wars Rebels — \"Fire Across the Galaxy\" (Mentioned only)\n Star Wars Rebels — \"The Future of the Force\" (Mentioned only)\nLeia Organa: Ordeal of the Princess (In flashback(s))\n \"Ice Breaking\" — Star Wars Rebels Magazine 16 (Indirect mention only)\n Star Wars Rebels — \"Shroud of Darkness\" (Vision)\nAge of Rebellion - Darth Vader 1 (In flashback(s))\n Star Wars Rebels — \"Trials of the Darksaber\" (In flashback(s))\nThrawn: Alliances\nThrawn: Alliances audiobook\nThe Mighty Chewbacca in the Forest of Fear! (Mentioned only)\nThe Mighty Chewbacca in the Forest of Fear! audiobook (Mentioned only)\nThrawn: Treason (Mentioned only)\nThrawn: Treason audiobook (Mentioned only)\nStar Wars Adventures: Tales from Vader's Castle 2 (In flashback(s))\nStar Wars Adventures: Return to Vader's Castle 4 (In flashback(s))\nObi-Wan 1 (In flashback(s))\nObi-Wan 2 (In flashback(s))\nObi-Wan 3 (In flashback(s))\nObi-Wan 4 (In flashback(s))\nRogue One: A Star Wars Story novelization (Mentioned only)\nRogue One: A Star Wars Story audiobook (Mentioned only)\nStar Wars: Episode IV A New Hope (First mentioned) (Indirect mention only)\nA New Hope: The Princess, the Scoundrel, and the Farm Boy (Mentioned only)\nA New Hope: The Princess, the Scoundrel, and the Farm Boy audiobook (Mentioned only)\nStar Wars: A New Hope junior novelization (Indirect mention only)\nEpisode IV: A New Hope Read-Along Storybook and CD (Indirect mention only)\nThe Adventures of Luke Skywalker, Jedi Knight\nThe Rise of a Hero\nStar Wars: The Original Trilogy – A Graphic Novel\n\"Stories in the Sand\" — From a Certain Point of View (Appears in hologram)\n\"Stories in the Sand\" — From a Certain Point of View audiobook (Appears in hologram)\n\"The Hero's Journey Begins\" — The Original Trilogy Stories (Indirect mention only)\n Star Wars Galaxy of Adventures — \"Obi-Wan Kenobi\" (In flashback(s))\n\"Master and Apprentice\" — From a Certain Point of View (Mentioned only)\n\"Master and Apprentice\" — From a Certain Point of View audiobook (Mentioned only)\n\"We Don't Serve Their Kind Here\" — From a Certain Point of View (Indirect mention only)\n\"We Don't Serve Their Kind Here\" — From a Certain Point of View audiobook (Indirect mention only)\n Star Wars Galaxy of Adventures — \"Princess Leia – The Rescue\"\nLando 3 (Mentioned only)\nLando 4 (Mentioned only)\nLando 5 (Mentioned only)\nHeir to the Jedi (Mentioned only)\nHeir to the Jedi audiobook (Mentioned only)\nThe Weapon of a Jedi: A Luke Skywalker Adventure (Mentioned only)\nThe Weapon of a Jedi: A Luke Skywalker Adventure audiobook (Mentioned only)\nStar Wars (2015) 2 (Indirect mention only)\nStar Wars (2015) 4 (Indirect mention only)\nDoctor Aphra: An Audiobook Original (Indirect mention only)\nDarth Vader (2015) 4 (In flashback(s))\nDarth Vader (2015) 6 (In flashback(s))\nStar Wars (2015) 9 (Appears in holocron)\nStar Wars (2015) 10 (Mentioned only)\nDoctor Aphra (2016) 2 (In flashback(s))\nDoctor Aphra (2016) 4 (Mentioned only)\nDoctor Aphra (2016) 5 (Mentioned only)\nDoctor Aphra (2016) 6 (Mentioned only)\nDoctor Aphra (2016) 9 (Mentioned only)\nDoctor Aphra (2016) 12 (Indirect mention only)\nStar Wars (2015) 43 (Indirect mention only)\nStar Wars (2015) 58 (Mentioned only)\n \"Tales of Villainy: A Last Chapter\" — Star Wars Adventures (2020) 13 (as a statue)\nYoda 1\nYoda 2\nYoda 3\nYoda 4\nYoda 5\nYoda 6\nYoda 7\nYoda 8\nYoda 9\nYoda 10\nStar Wars: Episode V The Empire Strikes Back (First appearance)\nThe Empire Strikes Back: So You Want to Be a Jedi?\nThe Empire Strikes Back: So You Want to Be a Jedi? audiobook\nStar Wars: The Empire Strikes Back junior novelization\n\"Rogue Two\" — From a Certain Point of View: The Empire Strikes Back (Indirect mention only)\n\"Rogue Two\" — From a Certain Point of View: The Empire Strikes Back audiobook (Indirect mention only)\n\"The Trial of Dagobah\" — Age of Rebellion Special 1 (Mentioned only)\n Star Wars Galaxy of Adventures — \"Luke Skywalker Trains with Master Yoda\"\n\"Faith in an Old Friend\" — From a Certain Point of View: The Empire Strikes Back (Appears on screen)\n\"Faith in an Old Friend\" — From a Certain Point of View: The Empire Strikes Back audiobook (Appears on screen)\n Star Wars Galaxy of Adventures — \"Yoda – The Jedi Master\"\n\"Disturbance\" — From a Certain Point of View: The Empire Strikes Back (Mentioned only)\n\"Disturbance\" — From a Certain Point of View: The Empire Strikes Back audiobook (Mentioned only)\n Star Wars Forces of Destiny — \"The Path Ahead\"\n\"Vergence\" — From a Certain Point of View: The Empire Strikes Back\n\"Vergence\" — From a Certain Point of View: The Empire Strikes Back audiobook\n Star Wars Galaxy of Adventures — \"Boba Fett - The Bounty Hunter\"\nCaptured on Cloud City\n\"The Witness\" — From a Certain Point of View: The Empire Strikes Back\n\"The Witness\" — From a Certain Point of View: The Empire Strikes Back audiobook\n Star Wars Galaxy of Adventures — \"Clash on Cloud City\"\n Star Wars Galaxy of Adventures — \"Luke Skywalker vs. Darth Vader – Join Me\"\nDarth Vader (2020) 1 (In flashback(s))\nStar Wars (2020) 1\nStar Wars (2020) 2\n\"Right-Hand Man\" — From a Certain Point of View: The Empire Strikes Back\n\"Right-Hand Man\" — From a Certain Point of View: The Empire Strikes Back audiobook\nStar Wars (2020) 3\nStar Wars (2020) 4\nStar Wars (2020) 5\nStar Wars (2020) 6\nDarth Vader (2020) 2 (In flashback(s))\nDarth Vader (2020) 3 (In flashback(s))\nDarth Vader (2020) 5 (In flashback(s))\nDarth Vader (2020) 6 (In flashback(s))\nDarth Vader (2020) 7 (In flashback(s))\nDarth Vader (2020) 8 (In flashback(s))\nDarth Vader (2020) 10 (In flashback(s))\nDarth Vader (2020) 11 (Vision to Darth Vader)\nStar Wars (2020) 8\nStar Wars (2020) 9\nStar Wars (2020) 10 (Cover only)\nStar Wars (2020) 13\nWar of the Bounty Hunters 1\nStar Wars (2020) 14\nDarth Vader (2020) 12 (In flashback(s))\nStar Wars (2020) 15\nDarth Vader (2020) 13 (In flashback(s))\nWar of the Bounty Hunters 2 (Voice only)\nWar of the Bounty Hunters 3\nStar Wars (2020) 16\nDarth Vader (2020) 16\nWar of the Bounty Hunters 4\nStar Wars (2020) 17\nWar of the Bounty Hunters 5\nDarth Vader (2020) 17\nCrimson Reign 1 (Voice only)\nStar Wars (2020) 19\nStar Wars (2020) 20\nDoctor Aphra (2020) 16 (Mentioned only)\nCrimson Reign 2 (Sculpture only)\nCrimson Reign 3 (In flashback(s))\nCrimson Reign 4 (Indirect mention only)\nDarth Vader (2020) 18 (In flashback(s))\nDarth Vader (2020) 19 (In flashback(s))\nDarth Vader (2020) 20 (Appears in hologram) (In flashback(s))\nDarth Vader (2020) 23 (In flashback(s))\nDarth Vader (2020) 24 (In flashback(s))\nDarth Vader (2020) 26 (In flashback(s))\nDarth Vader (2020) 28 (Sculpture only)\nStar Wars (2020) 26\nStar Wars (2020) 27\nStar Wars (2020) 28\nHidden Empire 1\nRevelations 1 (Vision to Darth Vader)\nHidden Empire 2\nHidden Empire 3\nHidden Empire 5\nDoctor Aphra (2020) 31\nStar Wars (2020) 29\nStar Wars (2020) 30\nStar Wars (2020) 31\nStar Wars (2020) 32\nStar Wars (2020) 33\nDarth Vader (2020) 32 (In flashback(s))\nDarth Vader (2020) 33 (In flashback(s))\nDarth Vader (2020) 34 (Vision to Sabé)\nDarth Vader (2020) 35 (In flashback(s))\nDoctor Aphra (2020) 32\nDoctor Aphra (2020) 33\nDoctor Aphra (2020) 34\nStar Wars (2020) 34\nStar Wars (2020) 35\nDark Droids 1\nBounty Hunters 37 (Indirect mention only) (In flashback(s))\nDarth Vader (2020) 37 (In flashback(s))\nDark Droids 2\nMoving Target: A Princess Leia Adventure\nMoving Target: A Princess Leia Adventure audiobook\nTales from the Rancor Pit (Mentioned only)\nStar Wars: Episode VI Return of the Jedi\nStar Wars: Return of the Jedi junior novelization\nReturn of the Jedi: Beware the Power of the Dark Side!\nReturn of the Jedi: Beware the Power of the Dark Side! audiobook\nRescue from Jabba's Palace\n\"Fancy Man\" — From a Certain Point of View: Return of the Jedi\nTIE Fighter 4 (Indirect mention only) (In flashback(s))\n\"Masters\" — Stories of Jedi and Sith\n\"Masters\" — Stories of Jedi and Sith audiobook\nEwoks Join the Fight\n Star Wars Galaxy of Adventures — \"Luke vs. Emperor Palpatine - Rise to Evil\"\nShattered Empire 1\n Star Wars Forces of Destiny — \"Traps and Tribulations\"\nThe Princess and the Scoundrel\nThe Princess and the Scoundrel audiobook\nReturn of the Jedi – Max Rebo 1 (In flashback(s))\nAlphabet Squadron (Mentioned only)\nAlphabet Squadron audiobook (Mentioned only)\nStar Wars Adventures: Ghosts of Vader's Castle 1 (In dream)\nStar Wars Adventures: Ghosts of Vader's Castle 3 (In dream)\nStar Wars Adventures: Ghosts of Vader's Castle 5 (Appears as a ghost or spirit)\nShattered Empire 4\nShadow Fall (Mentioned only)\nShadow Fall audiobook (Mentioned only)\nAftermath: Empire's End (Indirect mention only)\nAftermath: Empire's End audiobook (Indirect mention only)\nThe Mandalorian Junior Novel (Mentioned only)\nThe Mandalorian Junior Novel audiobook (Mentioned only)\n The Mandalorian — \"Chapter 8: Redemption\" (Mentioned only)\nThe Mandalorian 8 (Mentioned only)\nThe Mandalorian Season 2 Junior Novel\nThe Mandalorian: The Path of the Force\n The Mandalorian — \"Chapter 11: The Heiress\" (Indirect mention only)\nThe Mandalorian Season 2 3 (Indirect mention only)\n The Mandalorian — \"Chapter 13: The Jedi\" (Mentioned only)\n The Mandalorian — \"Chapter 16: The Rescue\"\nThe Mandalorian: The Rescue\nThe Book of Boba Fett Junior Novel\n The Book of Boba Fett — \"Chapter 6: From the Desert Comes a Stranger\"\n The Mandalorian — \"Chapter 20: The Foundling\" (In flashback(s))\n The Mandalorian — \"Chapter 22: Guns for Hire\" (Mentioned only)\n Ahsoka — \"Part One: Master and Apprentice\" (Mentioned only)\n Ahsoka — \"Part Three: Time to Fly\" (Mentioned only)\nShadow of the Sith\nShadow of the Sith audiobook\nBloodline (Indirect mention only)\nBloodline audiobook (Indirect mention only)\nThe Rise of Kylo Ren 1\nThe Rise of Kylo Ren 2\nThe Rise of Kylo Ren 3\nThe Rise of Kylo Ren 4\nAge of Resistance - Supreme Leader Snoke 1 (Vision to Kylo Ren)\n\"The Crimson Corsair and the Lost Treasure of Count Dooku\" (Mentioned only)\nForce Collector (Appears in hologram)\nForce Collector audiobook (Appears in hologram)\nAge of Resistance - Kylo Ren 1 (Indirectly mentioned only; in the opening crawl)\nStar Wars: Episode VII The Force Awakens (Indirect mention only)\nStar Wars: The Force Awakens novelization (Mentioned only)\nStar Wars: The Force Awakens audiobook (Mentioned only)\nStar Wars: The Force Awakens: A Junior Novel (Mentioned only)\nStar Wars: The Force Awakens: A Junior Novel audiobook (Mentioned only)\nStar Wars: The Force Awakens Graphic Novel Adaptation (Mentioned only)\nThe Force Awakens Adaptation 3 (Mentioned only)\nGalaxy's Edge: Black Spire (Emblem only)\nGalaxy's Edge: Black Spire audiobook (Emblem only)\nStar Wars Adventures Ashcan (In flashback(s))\n\"The Wine in Dreams\" — Canto Bight (Mentioned only)\n\"The Wine in Dreams\" — Canto Bight audiobook (Mentioned only)\nStar Wars: Episode VIII The Last Jedi\nStar Wars: The Last Jedi: Expanded Edition\nStar Wars: The Last Jedi: Expanded Edition audiobook\nStar Wars: The Last Jedi: A Junior Novel\nStar Wars: The Last Jedi: A Junior Novel audiobook\nThe Last Jedi: Rey's Journey (Emblem only)\nThe Last Jedi Adaptation 1 (Mentioned only)\nThe Last Jedi Adaptation 3 (In flashback(s))\nThe Last Jedi Adaptation 4 (In flashback(s))\nThe Last Jedi Adaptation 5 (Mentioned only)\n \"Life Lessons\" — Star Wars Adventures (2017) 26\nPoe Dameron 26\nPoe Dameron 27\nPoe Dameron 28\nResistance Reborn\nResistance Reborn audiobook\n\"Through the Turbulence\" — Stories of Jedi and Sith\n\"Through the Turbulence\" — Stories of Jedi and Sith audiobook\nAllegiance 1\nAllegiance 2\nAllegiance 3\nAllegiance 4\nSpark of the Resistance\nSpark of the Resistance audiobook\nGalaxy's Edge 2 (In flashback(s))\n\"The Dark Mirror\" — Dark Legends (In flashback(s))\nStar Wars: Galaxy's Edge\nStar Wars: Tales from the Galaxy's Edge (In flashback(s))\nStar Wars: Tales from the Galaxy's Edge – Last Call (In flashback(s))\nHalcyon Legacy 1 (In flashback(s))\nHalcyon Legacy 3 (In flashback(s))\nStar Wars: Galactic Starcruiser\n\"See You Around, Kid\" — Star Wars (2020) 25 (as a statue)\n \"Squad Goals\" — Star Wars Adventures (2017) 31\n \"The Obstacle Course, Part 1\" — Star Wars Adventures (2020) 1\n \"The Obstacle Course, Part 2\" — Star Wars Adventures (2020) 2\n \"Repair Stop\" — Star Wars Adventures (2020) 13\n \"Repair Stop, Part II\" — Star Wars Adventures (2020) 14\nHyperspace Stories 3\nHyperspace Stories 4\n \"Tales from Wild Space: Stop, Thief!\" — Star Wars Adventures (2017) 1\n \"Tales from Wild Space: A Small Push\" — Star Wars Adventures (2017) 12\n \"Tales from Wild Space: The Journey\" — Star Wars Adventures (2017) 20 (In flashback(s))\n \"The Lost Stories, Part 3\" — Star Wars Adventures (2017) 32 (Picture only)\nStar Wars: Episode IX The Rise of Skywalker\nStar Wars: The Rise of Skywalker: Expanded Edition\nStar Wars: The Rise of Skywalker: Expanded Edition audiobook\nStar Wars: The Rise of Skywalker: A Junior Novel\nStar Wars: The Rise of Skywalker: A Junior Novel audiobook\nStar Wars: The Rise of Skywalker Graphic Novel Adaptation\nThe Rise of Skywalker Adaptation 1\n\"Return of the Whills\" — From a Certain Point of View: Return of the Jedi (Indirect mention only)\n\nNon-canon appearances[]\n\n Star Wars: Visions — \"Journey to the Dark Head\" (Ambiguous canonicity)\n Star Wars: Jedi Temple Challenge — \"Episode 2\"\n Star Wars: Jedi Temple Challenge — \"Episode 3\"\n Star Wars: Jedi Temple Challenge — \"Episode 4\"\n Star Wars: Jedi Temple Challenge — \"Episode 5\"\n Star Wars: Jedi Temple Challenge — \"Episode 7\"\n Star Wars: Jedi Temple Challenge — \"Episode 9\"\n Star Wars: Jedi Temple Challenge — \"Episode 10\"\n LEGO STAR WARS: Celebrate the Season — \"All I Want For Life Day\"\n LEGO Star Wars: All-Stars — \"The Chase with Han/Escape with Chewbacca\" (Mentioned only)\n LEGO Star Wars: The Freemaker Adventures — \"A Hero Discovered\" (Appears in holocron)\n LEGO Star Wars: The Freemaker Adventures — \"The Pit and the Pinnacle\" (Emblem only)\n LEGO Star Wars: Droid Tales — \"Exit from Endor\" (In flashback(s))\n LEGO Star Wars: Droid Tales — \"Crisis on Coruscant\" (In flashback(s))\nLEGO Star Wars: Droid Tales Episodes I-III (In flashback(s))\nStar Wars: Trials on Tatooine (Mentioned only in opening crawl)\nLEGO Star Wars: The Force Awakens (Mentioned only)\nStar Wars: Galaxy of Heroes\n\"The Dragonsnake Saves R2-D2\" — From a Certain Point of View: The Empire Strikes Back\nLEGO Star Wars: The Skywalker Saga\n LEGO STAR WARS: Celebrate the Season — \"Happy Celebration 45th Anniversary A New Hope\"\n\nSources[]\n\n \"Children of the Force\" Episode Guide - The Clone Wars on StarWars.com (backup link)\n Darth Bane in the Encyclopedia (content now obsolete; backup link)\n Dwarf spider droid in the Encyclopedia (content now obsolete; backup link)\n Ilum in the Encyclopedia (content now obsolete; backup link)\n Jedi Order in the Encyclopedia (content now obsolete; backup link)\n Jedi starfighter in the Encyclopedia (content now obsolete; backup link)\n Jedi T-6 shuttle in the Encyclopedia (content now obsolete; backup link)\n Jedi Temple in the Encyclopedia (content now obsolete; backup link)\n Jedi Temple Guard in the Encyclopedia (content now obsolete; backup link)\n Lightsaber in the Encyclopedia (content now obsolete; backup link)\n lightsaber crystals in the Encyclopedia (content now obsolete; backup link)\n Lux Bonteri in the Encyclopedia (content now obsolete; backup link)\n Separatist Alliance in the Encyclopedia (content now obsolete; backup link)\n Sith in the Encyclopedia (content now obsolete; backup link)\nStar Wars Rebels: The Visual Guide\n Star Wars Rebels Extended Trailer (Official)) on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n SDCC 2014: \"The Heroes of Star Wars Rebels\" Panel - Liveblog on StarWars.com (backup link)\n \"Path of the Jedi\" Episode Guide | Star Wars Rebels on StarWars.com (backup link)\n Rebels Recon #1.09: Inside \"Path of the Jedi\" | Star Wars Rebels on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\nSabine My Rebel Sketchbook (Indirect mention only)\n\n Star Wars: Card Trader (Set: Base Series 1) \n\n Star Wars: Card Trader (Card: Aayla Secura - Jedi Knight - Base Series 1)\n Star Wars: Card Trader (Card: Adi Gallia - Jedi Master - Base Series 1)\n Star Wars: Card Trader (Card: Anakin Skywalker - Padawan - Base Series 1)\n Star Wars: Card Trader (Card: Barriss Offee - Jedi Padawan - Base Series 1)\n Star Wars: Card Trader (Card: Count Dooku - Separatist Leader - Base Series 1)\n Star Wars: Card Trader (Card: Darth Sidious - Sith Master - Base Series 1)\n Star Wars: Card Trader (Card: Jocasta Nu - Jedi Archivist - Base Series 1)\n Star Wars: Card Trader (Card: Luke Skywalker - Jedi Knight - Base Series 1)\n Star Wars: Card Trader (Card: Luminara Unduli - Galactic Republic - Base Series 1)\n Star Wars: Card Trader (Card: Mace Windu - Jedi Council - Base Series 1)\n Star Wars: Card Trader (Card: Mace Windu - Jedi Master (ROTS) - Base Series 1)\n Star Wars: Card Trader (Card: Plo Koon - Jedi Master - Base Series 1)\n Star Wars: Card Trader (Card: Stass Allie - Jedi Master - Base Series 1)\n Star Wars: Card Trader (Card: Supreme Chancellor Palpatine - Galactic Republic - Base Series 1)\n Star Wars: Card Trader (Card: Yarael Poof - Jedi Master - Base Series 1)\n Star Wars: Card Trader (Card: Yoda - Jedi Council - Base Series 1)\n Star Wars: Card Trader (Card: Yoda - Jedi Master (ESB) - Base Series 1)\n\nUltimate Star Wars\nStar Wars: Absolutely Everything You Need to Know\nThe Art of Star Wars: Uprising\nStar Wars: The Force Awakens: The Visual Dictionary\n Star Wars Helmet Collection 2 (Databank A-Z: Alzoc III–Antilles)\nNexus of Power\n Star Wars Helmet Collection 6 (Databank A-Z: Jar Jar Binks–B'omarr Order)\nStar Wars Character Encyclopedia: Updated and Expanded\nStar Wars Expert Guide\n Star Wars Helmet Collection 10 (Databank A-Z: Chewbacca–Cloud City)\n Star Wars Helmet Collection 10 (Highlights of the Saga: Birth of an Empire)\n Star Wars Helmet Collection 11 (Databank A-Z: Rush Clovis–Coruscant)\n Star Wars Helmet Collection 12 (Databank A-Z: Cosians–Dagobah)\n Star Wars Helmet Collection 13 (Databank A-Z: Poe Dameron–Delta 7-B)\n Star Wars Helmet Collection 14 (Weapons & Uniforms: The Sith)\n Star Wars Helmet Collection 15 (Databank A-Z: Dooku–Dwarf Spider Droids)\n Star Wars Helmet Collection 15 (Highlights of the Saga: Palpatine Unmasked)\n Star Wars Helmet Collection 15 (Weapons & Uniforms: The Grand Army of the Republic)\n Star Wars Helmet Collection 16 (Weapons & Uniforms: Citizens of Coruscant)\nStar Wars: Aliens of the Galaxy\n Star Wars Helmet Collection 17 (Helmets: Anakin Skywalker Podracer)\nStar Wars: The Force Awakens Beginner Game\n Star Wars Helmet Collection 18 (Databank A-Z: First Order–Fyrnocks)\nStar Wars: Complete Locations\n Star Wars Helmet Collection 20 (Databank A-Z: Saw Gerrera–Commander Gree)\n Much to Learn You Still Have: 8 Things You Might Not Know About Wookiees on StarWars.com (backup link)\nStar Wars Propaganda: A History of Persuasive Art in the Galaxy\nPoe Dameron: Flight Log\n\n Star Wars: Destiny — Awakenings \n\n Star Wars: Destiny — Awakenings (Card: Abandon All Hope) (backup link) (Picture only)\n Star Wars: Destiny — Awakenings (Card: All In) (backup link) (Picture only)\n Star Wars: Destiny — Awakenings (Card: Block) (backup link) (Picture only)\n\nStar Wars: Galactic Atlas\n Star Wars Helmet Collection 23 (Databank A-Z: Hassk Triplets–Holograms)\nPrincess Leia: Royal Rebel\n Star Wars Helmet Collection 24 (Databank A-Z: The HoloNet–General Hux)\nEntertainment Weekly's Ultimate Guide to Rogue One\nStar Wars: Rogue One: The Ultimate Visual Guide\n Star Wars Helmet Collection 27 (Databank A-Z: InterGalactic Banking Clan–Jakku)\n Star Wars Helmet Collection 28 (Databank A-Z: Queen Jamillia–Jedi Temples)\n Star Wars: Build Your Own R2-D2 1 (Droid Directory: R2-series Astromech Droids, Part 1) (Picture only)\n Star Wars: Build Your Own R2-D2 3 (Droid Directory: R2-series Astromech Droids, Part 2) (Picture only)\n Star Wars: Build Your Own R2-D2 4 (Building the Galaxy: Filming R2-D2, Part 1) (Picture only)\nNo Disintegrations\n Star Wars Helmet Collection 29 (Databank A-Z: Jelucan–Lord Junn)\n Star Wars Helmet Collection 30 (Highlights of the Saga: The Betrayal of Captain Argyus)\nDarth Vader: Sith Lord\n Star Wars Helmet Collection 32 (Databank A-Z: Kel Dor–Ki-Adi-Mundi)\nStar Wars: The Visual Encyclopedia\n Star Wars Helmet Collection 33 (Databank A-Z: Admiral Kilian–Kowakian)\n Star Wars Helmet Collection 33 (Highlights of the Saga: The Unlikely Heroes)\n Star Wars Helmet Collection 33 (Weapons & Uniforms: The Republic Fleet)\n Star Wars Helmet Collection 35 (Databank A-Z: Kyber Crystals–Laser Cannons)\n Star Wars Helmet Collection 37 (Databank A-Z: Luggabeast–Malakili)\n Star Wars Helmet Collection 38 (Helmets: Commander Thire)\n Star Wars Helmet Collection 40 (Databank A-Z: Moraband–Muftak)\n Star Wars Helmet Collection 40 (Weapons & Uniforms: The Jedi Knights)\nStar Wars: On the Front Lines\n Star Wars Helmet Collection 41 (Databank A-Z: 'Occupier' Tank–Oola)\n Star Wars Helmet Collection 41 (Helmets: Jango Fett)\n Star Wars Helmet Collection 41 (Highlights of the Saga: The Secret of Kamino)\nStar Wars Forces of Destiny: Meet the Heroes\n Star Wars Helmet Collection 42 (Databank A-Z: OOM-9–Viceroy Bail Organa)\n Star Wars Helmet Collection 44 (Databank A-Z: Zeb Orrelios–Pau City)\n Star Wars Helmet Collection 44 (Highlights of the Saga: Striking at the New Republic)\nStar Wars: Absolutely Everything You Need to Know, Updated and Expanded\n Star Wars Helmet Collection 46 (Databank A-Z: Providence-class–Raxus) (First identified as New Jedi Order)\nForces of Destiny: Tales of Hope & Courage\n Star Wars Helmet Collection 47 (Weapons & Uniforms: The Lothal Rebels)\n Star Wars Helmet Collection 49 (Databank A-Z: Serenno–Anakin Skywalker)\nStar Wars: The Rebel Files\n Star Wars Helmet Collection 50 (Databank A-Z: Luke Skywalker–Han Solo)\n Star Wars Helmet Collection 51 (Databank A-Z: Soulless One–Super Battle Droids)\n Star Wars Helmet Collection 51 (Weapons & Uniforms: Dark Side Servants)\nStar Wars: The Last Jedi: Heroes of the Galaxy\nStar Wars: The Last Jedi: The Visual Dictionary\nStar Wars: The Last Jedi: Ultimate Sticker Collection\n Star Wars Helmet Collection 52 (Databank A-Z: Hera Syndulla–Ahsoka Tano)\nStar Wars: Lightsaber Battles\n Star Wars Helmet Collection 53 (Databank A-Z: Tantive IV–Tatooine) (Indirect mention only)\n Star Wars Bust Collection 1 (Star Wars Universe: Darth Vader)\n Star Wars Helmet Collection 54 (Databank A-Z: Tauntaun–TIE Craft)\n Star Wars Bust Collection 2 (Star Wars Universe: Stormtroopers)\n Star Wars Helmet Collection 55 (Databank A-Z: Saesee Tiin–Toydaria)\n Star Wars Helmet Collection 55 (Highlights of the Saga: Target: The Holy City)\nDawn of Rebellion\nStar Wars Encyclopedia of Starfighters and Other Vehicles\n Star Wars Helmet Collection 59 (Databank A-Z: Darth Tyranus)\nStar Wars Lightsabers: A Guide to Weapons of the Force\n Star Wars Helmet Collection 60 (Databank A-Z: U'Il–Luminara Unduli)\n Star Wars Helmet Collection 65 (Databank A-Z: VCX-100 Light Freighter–Veers)\n Star Wars Helmet Collection 65 (Weapons & Uniforms: Inhabitants of Jedha)\n Star Wars Helmet Collection 66 (Databank A-Z: Venator–Asajj Ventress)\n Star Wars Helmet Collection 68 (Databank A-Z: Pre Vizsla–Quinlan Vos)\n Star Wars Helmet Collection 69 (Databank A-Z: Vulptex–Wampas)\n Star Wars Helmet Collection 69 (Highlights of the Saga: The Rebirth of Caleb Dume)\n Star Wars Helmet Collection 69 (Weapons & Uniforms: The Jedi Purge)\n Star Wars: Build Your Own X-Wing 1 (Starfighter Aces: Luke Skywalker – Savior of the Rebel Alliance) (Picture only)\nSolo: A Star Wars Story: Tales from Vandor\nStar Wars: The Complete Visual Dictionary, New Edition\n Star Wars Helmet Collection 72 (Databank A-Z: Mace Windu)\n Star Wars Helmet Collection 72 (Highlights of the Saga: Luke's Journey in the Force)\n Star Wars Helmet Collection 72 (Weapons & Uniforms: Training the Jedi)\nStar Wars: Alien Archive\n Star Wars Helmet Collection 73 (Databank A-Z: Admiral Wiskovis–The Works)\nStar Wars: Scum and Villainy: Case Files on the Galaxy's Most Notorious\nStar Wars: Women of the Galaxy\n Star Wars: Build Your Own X-Wing 11 (Starfighter Aces: Jango Fett – Legendary Bounty Hunter)\nStar Wars: Smuggler's Guide\n Star Wars Helmet Collection 76 (Databank A-Z: Xev Xrexus–Yavin 4)\nStar Wars: The Dark Side\n Star Wars Helmet Collection 77 (Databank A-Z: Grand Master Yoda)\n Star Wars Helmet Collection 77 (Helmets: Silvanie Phest)\n Star Wars Helmet Collection 78 (Databank A-Z: Admiral Yularen–Zarro)\n Star Wars Helmet Collection 79 (Databank A-Z: Zabrak–Zillo Beast)\n Jedi Knights | Star Wars Galaxy of Adventures Fun Facts on the official Star Wars Kids YouTube channel (backup link)\nStar Wars Character Encyclopedia, New Edition\nStar Wars Search and Find Volume I\nAllies and Adversaries\nTIE Fighter Owners' Workshop Manual\nRise of the Separatists\n The Star Wars Timeline | Star Wars Galaxy of Adventures Fun Facts on the official Star Wars Kids YouTube channel (backup link)\nCollapse of the Republic\nStar Wars: How Not to Get Eaten by Ewoks and Other Galactic Survival Skills\nGadgets and Gear\nStar Wars: Creatures Big & Small (Emblem only)\nUltimate Star Wars, New Edition\nRebel Starfighters Owners' Workshop Manual\nStar Wars: The Secrets of the Jedi\n\n Star Wars: Card Trader (Set: 2020 Base Series) \n\n Star Wars: Card Trader (Card: Mace Windu - 2020 Base Series)\n Star Wars: Card Trader (Card: Obi-Wan Kenobi - 2020 Base Series)\n Star Wars: Card Trader (Card: Qui-Gon Jinn - 2020 Base Series)\n Star Wars: Card Trader (Card: Yoda - 2020 Base Series)\n\nStar Wars: The Rise of Skywalker: The Galactic Guide\n \"Together Again\" Episode Guide | The Clone Wars on StarWars.com (backup link)\n Disney Gallery: The Mandalorian — \"Directing\"\n Disney Gallery: The Mandalorian — \"Legacy\"\n Disney Gallery: The Mandalorian — \"Cast\"\n Disney Gallery: The Mandalorian — \"Technology\"\n Disney Gallery: The Mandalorian — \"Practical\"\n Disney Gallery: The Mandalorian — \"Process\"\n Disney Gallery: The Mandalorian — \"Score\"\n\n Star Wars: Card Trader (Set: Topps' Women of Star Wars) \n\n Star Wars: Card Trader (Card: Ahsoka Tano - Topps' Women of Star Wars)\n Star Wars: Card Trader (Card: Depa Billaba - Topps' Women of Star Wars)\n Star Wars: Card Trader (Card: Tiplar - Topps' Women of Star Wars)\n\n Disney Gallery: The Mandalorian — \"Connections\"\n\n Star Wars: Card Trader (Set: 2020 Base Series 2) \n\n Star Wars: Card Trader (Card: Luke Skywalker - 2020 Base Series 2)\n Star Wars: Card Trader (Card: Mace Windu - 2020 Base Series 2)\n\n \"Imperial Troops\" — Star Wars Encyclopedia (Picture only)\n \"R2-D2\" — Star Wars Encyclopedia\nThe Star Wars Book\nStar Wars: The Lightsaber Collection\n Star Wars: Card Trader (Card: Ahsoka Tano (TCW)- 2021 Base)\n \"Republic, Rebel, and Resistance Starfighters\" — Star Wars Encyclopedia\nThe Art of Star Wars: The Mandalorian Season One\n \"The Battle of Hoth and the Second Death Star\" — Star Wars Encyclopedia\n Disney Gallery: The Mandalorian — \"Making of Season Two\"\n \"The Final Order and the Battle of Exegol\" — Star Wars Encyclopedia\n Jedi Knight Vernestra Rwoh: Characters of Star Wars the High Republic on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n \"C-3PO\" — Star Wars Encyclopedia\n Avar Kriss | Characters of Star Wars: The High Republic on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n The Nihil: Characters of Star Wars the High Republic on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n Star Wars: The High Republic Show: A Deep Dive Into Star Wars: The High Republic, Bringing A Younger Yoda to Life (in VR), and More! on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n Jedi Padawan Bell Zettifar | Characters of Star Wars the High Republic on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n\"Before the dark times…\" — Star Wars - The Official Magazine 101\n Star Wars: Card Trader (Card: Cere Junda - 2021 Base - Series 2)\n \"Yoda and Other Users of the Force\" — Star Wars Encyclopedia\n \"A Certain Point of View\" — Star Wars Insider 202\n \"Aftermath\" Episode Guide | The Bad Batch on StarWars.com (backup link)\n \"Cut and Run\" Episode Guide | The Bad Batch on StarWars.com (backup link) (Picture only)\n Star Wars: The High Republic Show: New High Republic Comic Revealed, Lightsabers from the Prime of the Jedi, and More! on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n \"Anakin Skywalker\" — Star Wars Encyclopedia\n Disney Gallery: The Mandalorian — \"Making of the Season 2 Finale\"\nStar Wars: The Secrets of the Sith\nStar Wars: Battles that Changed the Galaxy\nStar Wars: The Mandalorian Handbook\n \"Ahsoka Tano and Other Users of the Force\" — Star Wars Encyclopedia\n Stranger | The Book of Boba Fett on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n \"General Equipment (2)\" — Star Wars Encyclopedia\n Obi-Wan Kenobi Photos and Details Revealed on StarWars.com (backup link)\n \"Crime and Punishment\" — Star Wars Insider 209\n Disney Gallery: The Mandalorian — \"The Book of Boba Fett\"\n Clones at 20 | 20 Unforgettable Quotes from Star Wars: Attack of the Clones on StarWars.com (backup link)\n Clones at 20 | Costume Designer Trisha Biggar Reflects on Her Most Challenging Film on StarWars.com (backup link)\n Obi-101: Everything You Need to Know About Obi-Wan Kenobi on StarWars.com (backup link)\n 10 of Obi-Wan Kenobi's Greatest Moments (So Far) on StarWars.com (backup link)\n Star Wars: The High Republic For Light and Life Panel | Star Wars Celebration Anaheim 2022 on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n SWCA 2022: 10 Things We Learned From the Star Wars: The High Republic Panel on StarWars.com (backup link)\n SWCA 2022: 7 Things We Learned from the Lucasfilm Publishing Behind the Page Panel on StarWars.com (backup link)\n The Story Behind Lucasfilm and Volkswagen's Fantastic Obi-Wan Kenobi-Inspired Vehicles on StarWars.com (backup link)\n This Week! in Star Wars The Obi-Wan Cast Chat About Obi-Wan, Reva's Intentions Are Revealed, and More! on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\nStar Wars: The Secrets of the Bounty Hunters\nStar Wars: The High Republic: Chronicles of the Jedi\n Star Wars: The High Republic Show: High Republic Phase II Deep Dive, Star Wars Celebration, and More! on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n New Concept Art and More Revealed on Star Wars: The High Republic Show on StarWars.com (backup link)\nStar Wars: Timelines\n\n Star Wars: Shatterpoint — Hello There Squad Pack \n\n Star Wars: Shatterpoint — Hello There Squad Pack (Card: Form III Soresu) (Picture only)\n Star Wars: Shatterpoint — Hello There Squad Pack (Card: Form IV Ataru) (Picture only)\n Star Wars: Shatterpoint — Hello There Squad Pack (Card: General Obi-Wan Kenobi (Order Card)) (Picture only)\n Star Wars: Shatterpoint — Hello There Squad Pack (Card: General Obi-Wan Kenobi (Stat Card)) (Picture only)\n\n Star Wars: The High Republic Show: The Fate of Burryaga Revealed, The High Republic Heads to San Diego Comic-Con, and More! on the official Star Wars YouTube channel (backup link)  (Posted on StarWars.com)\n Adi Gallia in the Databank (backup link)\n Admiral Kilian in the Databank (backup link)\n Agen Kolar in the Databank (backup link)\n Agent Del Meeko in the Databank (backup link)\n Ahch-To in the Databank (backup link)\n Ahch-To Jedi Temple in the Databank (backup link)\n Ahsoka Tano in the Databank (backup link)\n Ahsoka's lightsabers in the Databank (backup link)\n Anakin Skywalker in the Databank (backup link)\n Anakin, Luke, and Rey's Lightsaber in the Databank (backup link)\n Bail Organa in the Databank (backup link)\n Bardotta in the Databank (backup link)\n Barriss Offee in the Databank (backup link)\n Cere in the Databank (backup link)\n Coruscant in the Databank (backup link)\n Cosian in the Databank (backup link)\n Crucible in the Databank (backup link)\n Dagobah in the Databank (backup link)\n Darksaber in the Databank (backup link)\n Darth Bane in the Databank (backup link)\n Delta-7 Jedi Starfighter in the Databank (backup link)\n Depa Billaba in the Databank (backup link)\n Dwarf Spider Droid in the Databank (backup link)\n Eeth Koth in the Databank (backup link)\n Force Push in the Databank (backup link)\n Ganodi in the Databank (backup link)\n Gungi in the Databank (backup link)\n Holocron in the Databank (backup link)\n Ilum in the Databank (backup link)\n Inhibitor chip in the Databank (backup link)\n Jedi Order in the Databank (backup link)\n Jedi Starfighter in the Databank (backup link)\n Jedi T-6 Shuttle in the Databank (backup link)\n Jedi Temple in the Databank (backup link)\n Jedi Temple Guard in the Databank (backup link)\n Jedi Texts in the Databank (backup link)\n Kanan Jarrus/Caleb Dume in the Databank (backup link)\n Kyber Crystal (Lightsaber Crystal) in the Databank (backup link)\n Supreme Leader Kylo Ren in the Databank (backup link)\n Lightsaber in the Databank (backup link)\n Lor San Tekka in the Databank (backup link)\n Lothal Jedi Temple in the Databank (backup link)\n Luke Skywalker in the Databank (backup link)\n Lux Bonteri in the Databank (backup link)\n Mace Windu in the Databank (backup link)\n Nari in the Databank (backup link)\n Nooa in the Databank (backup link)\n Obi-Wan Kenobi in the Databank (backup link)\n Padmé Amidala in the Databank (backup link)\n Qui-Gon Jinn in the Databank (backup link)\n Sith in the Databank (backup link)\n Supreme Leader Snoke in the Databank (backup link)\n The Force in the Databank (backup link)\n Training Remote in the Databank (backup link)\n Yoda in the Databank (backup link)\n Yoda's Hut in the Databank (backup link)\n Zatt in the Databank (backup link)\n\nNotes and references[]\n\n\n↑ 1.0 1.1 Star Wars: The Complete Visual Dictionary, New Edition\n\n↑ 2.0 2.1 2.2 2.3 2.4 2.5 2.6 2.7 2.8 Ultimate Star Wars\n\n↑ 3.0 3.1 3.2 Rise of the Separatists\n\n↑ 4.0 4.1 4.2 4.3 4.4 4.5  Jedi Order in the Databank (backup link)\n\n↑ 5.0 5.1 Endless Vigil\n\n↑ 6.00 6.01 6.02 6.03 6.04 6.05 6.06 6.07 6.08 6.09 6.10 6.11 6.12 6.13 Star Wars: Complete Locations\n\n↑ 7.0 7.1 Aftermath: Empire's End\n\n↑ 8.00 8.01 8.02 8.03 8.04 8.05 8.06 8.07 8.08 8.09 8.10 8.11 8.12 8.13 8.14 8.15 8.16 8.17 Star Wars: Episode II Attack of the Clones\n\n↑ 9.0 9.1 9.2 9.3 9.4 Dooku: Jedi Lost\n\n↑  Russo-ISC in the Databank (backup link)\n\n↑ Star Wars: On the Front Lines\n\n↑ 12.0 12.1 12.2 Darth Vader (2017) 7\n\n↑ 13.0 13.1 Doctor Aphra (2016) 6\n\n↑ 14.0 14.1 14.2 14.3  Sith in the Encyclopedia (content now obsolete; backup link)\n\n↑ 15.0 15.1 15.2 15.3  Jedi Temple in the Databank (backup link)\n\n↑ 16.00 16.01 16.02 16.03 16.04 16.05 16.06 16.07 16.08 16.09 16.10 16.11 16.12 16.13 16.14 16.15 16.16 16.17 16.18 16.19 Star Wars: Episode VIII The Last Jedi\n\n↑ 17.00 17.01 17.02 17.03 17.04 17.05 17.06 17.07 17.08 17.09 17.10 17.11 17.12 17.13 17.14 17.15 17.16 17.17 17.18 17.19 Star Wars: Episode III Revenge of the Sith\n\n↑ 18.0 18.1 18.2 18.3 18.4 18.5 18.6 18.7 18.8 18.9 The Star Wars Book\n\n↑  Obi-Wan Kenobi — \"Part III\"\n\n↑  Luke Skywalker in the Databank (backup link)\n\n↑ Bloodline\n\n↑ 22.00 22.01 22.02 22.03 22.04 22.05 22.06 22.07 22.08 22.09 22.10 22.11 22.12 22.13 Star Wars: Episode I The Phantom Menace\n\n↑ 23.0 23.1 Darth Vader (2017) 2\n\n↑  Crucible in the Databank (backup link)\n\n↑ 25.0 25.1 25.2  Ahch-To Jedi Temple in the Databank (backup link)\n\n↑ Star Wars: Tales from the Galaxy's Edge\n\n↑  \"Starlight: Go Together\" — Star Wars Insider 199–200\n\n↑ Star Wars (2020) 2\n\n↑  Star Wars Resistance — \"The Relic Raiders\"\n\n↑ Gadgets and Gear\n\n↑ 31.0 31.1 31.2 31.3 31.4 31.5 31.6  Ilum in the Databank (backup link)\n\n↑ Age of Republic - General Grievous 1\n\n↑  Lothal Jedi Temple in the Databank (backup link)\n\n↑ 34.0 34.1 34.2 34.3 Star Wars Jedi: Survivor\n\n↑ 35.0 35.1 35.2 35.3 35.4 35.5 Star Wars (2015) 9\n\n↑ Star Wars: Uprising\n\n↑ 37.0 37.1  Star Wars: The Clone Wars — \"Monster\"\n\n↑  Inside Star Wars: The High Republic: Meet the Jedi Knights and Masters on StarWars.com (backup link)\n\n↑ 39.0 39.1 39.2 39.3 39.4 39.5 39.6 The Rise of Kylo Ren 2\n\n↑ 40.0 40.1 40.2 40.3 The High Republic: Out of the Shadows\n\n↑ The High Republic: Light of the Jedi\n\n↑ 42.0 42.1  Star Wars: The Clone Wars — \"The Mandalore Plot\"\n\n↑  Holocron in the Databank (backup link)\n\n↑  Star Wars: The Clone Wars — \"Holocron Heist\"\n\n↑ 45.0 45.1 Star Wars: The Last Jedi: The Visual Dictionary\n\n↑ 46.0 46.1  Star Wars: The Clone Wars — \"The Gathering\"\n\n↑ Kanan 7\n\n↑ 48.0 48.1 48.2 48.3 48.4 48.5 48.6 Star Wars: Episode VI Return of the Jedi\n\n↑ 49.0 49.1  Star Wars Rebels — \"Shroud of Darkness\"\n\n↑ The High Republic: The Battle of Jedha\n\n↑ 51.0 51.1 51.2 51.3 Star Wars: Timelines\n\n↑ 52.0 52.1 52.2 52.3 Star Wars: The Last Jedi: The Visual Dictionary\n\n↑ 53.00 53.01 53.02 53.03 53.04 53.05 53.06 53.07 53.08 53.09 53.10 53.11 53.12 53.13 53.14 Star Wars: Episode VII The Force Awakens\n\n↑  SWCE 2023: Three New Star Wars Movies Announced on StarWars.com (backup link)\n\n↑ 55.0 55.1 55.2 55.3 55.4 55.5 Star Wars: Galactic Atlas\n\n↑  Kathleen Kennedy on the Future of Star Wars | Star Wars Celebration 2023 on the IGN YouTube channel (April 7, 2023): \"We're fifteen years out from Rise of Skywalker.\" (backup link)\n\n↑ Obi-Wan and Anakin 5\n\n↑ 58.0 58.1 Star Wars (2020) 20\n\n↑ 59.0 59.1 59.2 59.3 59.4 59.5 Star Wars: Episode IV A New Hope\n\n↑ 60.0 60.1 60.2 60.3 60.4 60.5 60.6 The High Republic: Light of the Jedi\n\n↑  Sith in the Databank (backup link)\n\n↑ 62.0 62.1 Master & Apprentice\n\n↑ 63.0 63.1 63.2 63.3 63.4 63.5 Catalyst: A Rogue One Novel\n\n↑ 64.0 64.1 64.2 64.3 64.4 64.5 The High Republic: Convergence\n\n↑  Kyber Crystal (Lightsaber Crystal) in the Databank (backup link)\n\n↑  Lightsaber in the Databank (backup link)\n\n↑ 67.0 67.1 67.2 67.3 67.4 Star Wars: The Clone Wars film\n\n↑ 68.0 68.1 68.2 68.3  Star Wars: The Clone Wars — \"The Wrong Jedi\"\n\n↑  \"The Wrong Jedi\" Episode Gallery on StarWars.com (backup link)\n\n↑  Yoda in the Databank (backup link)\n\n↑ Ultimate Factivity Collection: Star Wars\n\n↑ 72.0 72.1 Obi-Wan and Anakin 1\n\n↑ Obi-Wan and Anakin 4\n\n↑ 74.0 74.1 74.2 74.3 74.4 74.5 Star Wars: The Secrets of the Jedi\n\n↑ Star Wars: The Rise of Skywalker: The Visual Dictionary states that the first Jedi Temple was constructed on Ahch-To tens of thousands of years before the events of Star Wars: Episode VIII The Last Jedi. Star Wars: The Rise of Skywalker: The Visual Dictionary places Star Wars: Episode VIII The Last Jedi in the same year as the events of Star Wars: Episode VII The Force Awakens, which Star Wars: Galactic Atlas dates to 34 ABY. Therefore, the first Jedi Temple was constructed tens of thousands of years before 34 ABY.\n\n↑ 76.0 76.1 76.2 76.3 76.4 76.5 76.6 Star Wars: The Rise of Skywalker: The Visual Dictionary\n\n↑  Coruscant in the Databank (backup link)\n\n↑  Jedi Temple Location Gallery in the Databank (backup link)\n\n↑  Star Wars: The Clone Wars — \"To Catch a Jedi\"\n\n↑ 80.0 80.1  Star Wars: The Clone Wars — \"Sabotage\"\n\n↑ 81.0 81.1 81.2 81.3 81.4 81.5 81.6 81.7 81.8 Tarkin\n\n↑ 82.0 82.1 82.2 82.3 82.4  Star Wars Rebels — \"Path of the Jedi\"\n\n↑ The Weapon of a Jedi: A Luke Skywalker Adventure\n\n↑ 84.0 84.1 84.2  Jedha in the Databank (backup link)\n\n↑ Video Interview With 'Rogue One: A Star Wars Story' Director Gareth Edwards by Sciretta, Peter on SlashFilm (July 15, 2016) (archived from the original on July 16, 2016)\n\n↑  ExtraTV (@extratv) on Twitter: \"@DonnieYenCT reveals connection between planet Jedha & lightsabers! #RogueOne #StarWars #SWCE\" (backup link)\n\n↑  Holy City of Jedha in the Databank (backup link)\n\n↑ 88.0 88.1 88.2 88.3 88.4 88.5  The Book of Boba Fett — \"Chapter 6: From the Desert Comes a Stranger\"\n\n↑ 89.0 89.1 89.2 Shadow of the Sith\n\n↑ 90.0 90.1 \"What a Jedi Makes\" — Stories of Jedi and Sith\n\n↑ 91.0 91.1 91.2  Star Wars: The Clone Wars — \"Dangerous Debt\"\n\n↑ The Rise of Kylo Ren 2\n\n↑ 93.0 93.1 Yoda 1\n\n↑ The High Republic: Into the Dark\n\n↑ 95.0 95.1 95.2 95.3 95.4 95.5 The High Republic: Midnight Horizon\n\n↑ 96.0 96.1 96.2 96.3 96.4 96.5 The High Republic: Path of Deceit\n\n↑ The High Republic Adventures (2021) 7\n\n↑  Star Wars: The Clone Wars — \"Supply Lines\"\n\n↑ 99.0 99.1  Star Wars: The Clone Wars — \"The Rise of Clovis\"\n\n↑ 100.0 100.1  Star Wars: The Clone Wars — \"Voyage of Temptation\"\n\n↑ 101.0 101.1 Star Wars: Episode II Attack of the Clones\n\n↑ Kanan 1\n\n↑ 103.0 103.1  Star Wars: The Clone Wars — \"Jedi Crash\"\n\n↑ 104.0 104.1 104.2 104.3 Star Wars: Episode V The Empire Strikes Back\n\n↑ The High Republic Adventures (2021) 12\n\n↑ 106.0 106.1 The Princess and the Scoundrel\n\n↑  The Book of Boba Fett — \"Chapter 5: Return of the Mandalorian\"\n\n↑ 108.0 108.1 108.2 108.3 108.4 108.5 108.6 Crimson Reign 3\n\n↑ 109.0 109.1 109.2 109.3 109.4 109.5 109.6 109.7 109.8 109.9 Star Wars Propaganda: A History of Persuasive Art in the Galaxy\n\n↑  SWCA 2022: Marvel's Star Wars: Yoda Miniseries Revealed on StarWars.com (backup link)\n\n↑  \"Tales of Enlightenment: A Different Perspective\" — Star Wars Insider 215\n\n↑ 112.0 112.1  Star Wars: The Clone Wars — \"The Jedi Who Knew Too Much\"\n\n↑  Star Wars: The Clone Wars — \"Defenders of Peace\"\n\n↑ 114.0 114.1 114.2 Jedi of the Republic – Mace Windu 5\n\n↑  Rafa in the Databank (backup link)\n\n↑ 116.0 116.1 116.2 116.3  Star Wars: Tales of the Jedi — \"Choices\"\n\n↑ 117.0 117.1 117.2  Star Wars: Tales of the Jedi — \"Justice\"\n\n↑  Star Wars: Tales of the Jedi — \"The Sith Lord\"\n\n↑ Darth Vader (2017) 1\n\n↑ Star Wars (2020) 26\n\n↑ \"Luke on the Bright Side\" — Stories of Jedi and Sith\n\n↑ 122.0 122.1 122.2 122.3  Star Wars: The Clone Wars — \"Tipping Points\"\n\n↑ Age of Republic - Darth Maul 1\n\n↑ 124.0 124.1  Star Wars Rebels — \"Homecoming\"\n\n↑ 125.0 125.1 125.2 125.3  Star Wars: The Clone Wars — \"Liberty on Ryloth\"\n\n↑  Lux Bonteri in the Databank (backup link)\n\n↑ Unlimited Power\n\n↑  Star Wars: The Clone Wars — \"A Test of Strength\"\n\n↑ Star Wars: The Rise of Skywalker: A Junior Novel\n\n↑  Jedi Order in the Encyclopedia (content now obsolete; backup link)\n\n↑ 131.0 131.1 131.2 131.3 131.4  Star Wars: The Clone Wars — \"Sacrifice\"\n\n↑ 132.0 132.1 132.2 132.3 132.4 132.5 132.6 132.7 Star Wars: The Force Awakens: The Visual Dictionary\n\n↑  Star Wars: The Clone Wars — \"The Big Bang\"\n\n↑  Jedi Temple in the Encyclopedia (content now obsolete; backup link)\n\n↑  Star Wars: The Clone Wars — \"Kidnapped\"\n\n↑  Star Wars: The Clone Wars — \"Slaves of the Republic\"\n\n↑  Star Wars: The Clone Wars — \"Escape from Kadavo\"\n\n↑ According to Star Wars Propaganda: A History of Persuasive Art in the Galaxy the Fall of the Old Republic took place prior to the founding of the Galactic Republic. The Star Wars Book states that the Galactic Republic was founded 1032 years before the events of Star Wars: Episode IV A New Hope, which corrosponds to 1032 BBY per Star Wars: Galactic Atlas. Therefore, the Fall of the Old Republic must have taken place prior to 1032 BBY\n\n↑ 139.0 139.1 139.2  Darth Bane in the Databank (backup link)\n\n↑  2018 Topps Star Wars Galactic Files (Card: Darth Bane) (backup link)\n\n↑ Star Wars: The Visual Encyclopedia\n\n↑  Star Wars Helmet Collection 29 (Databank A-Z: Jelucan–Lord Junn)\n\n↑ 143.0 143.1 143.2  Darth Bane in the Encyclopedia (content now obsolete; backup link)\n\n↑ Star Wars (2020) 20\n\n↑  Star Wars Rebels — \"Droids in Distress\"\n\n↑ Star Wars: The Rise of Skywalker: The Visual Dictionary states that a rumoured third volume of the Aionomica was the subject of a forgery scandal three hundred years before the fall of the Jedi Order, which Star Wars: Galactic Atlas dates to 19 BBY. Therefore, the scandal occurred in 319 BBY.\n\n↑ The High Republic (2022) 1\n\n↑ 148.0 148.1 148.2 148.3 148.4 The High Republic: The Rising Storm\n\n↑ The High Republic Adventures (2021) 9\n\n↑ The High Republic: Quest for Planet X\n\n↑ The High Republic: Trail of Shadows 5\n\n↑ The High Republic Adventures (2021) 8\n\n↑ The High Republic: Eye of the Storm 2\n\n↑ 154.0 154.1 154.2 154.3 154.4  Sifo-Dyas in the Databank (backup link)\n\n↑  Star Wars: The Clone Wars — \"The Lost One\"\n\n↑  Count Dooku in the Databank (backup link)\n\n↑  Star Wars: The Clone Wars — \"The Lawless\"\n\n↑ 158.0 158.1 158.2  Star Wars: The Clone Wars — \"Conspiracy\"\n\n↑  Star Wars: The Clone Wars — \"The Unknown\"\n\n↑ 160.0 160.1  Star Wars: The Clone Wars — \"Fugitive\"\n\n↑  Star Wars: The Clone Wars — \"Orders\"\n\n↑  Star Wars: The Clone Wars — \"Shattered\"\n\n↑ Star Wars Lightsabers: A Guide to Weapons of the Force\n\n↑ 164.0 164.1 Jedi of the Republic – Mace Windu 1\n\n↑ Brotherhood\n\n↑ 166.0 166.1 166.2 166.3  Star Wars: The Clone Wars — \"Carnage of Krell\"\n\n↑  Star Wars: The Clone Wars — \"The Hidden Enemy\"\n\n↑  Star Wars: The Clone Wars — \"Innocents of Ryloth\"\n\n↑  Star Wars: The Clone Wars — \"Landing at Point Rain\"\n\n↑  Star Wars: The Clone Wars — \"Weapons Factory\"\n\n↑  Star Wars: The Clone Wars — \"Legacy of Terror\"\n\n↑  Geonosis in the Databank (backup link)\n\n↑  Star Wars: The Clone Wars — \"Assassin\"\n\n↑  Star Wars: The Clone Wars — \"Citadel Rescue\"\n\n↑ Darth Maul—Son of Dathomir 3\n\n↑  General Pong Krell in the Databank (backup link)\n\n↑  Star Wars: The Clone Wars — \"The General\"\n\n↑ 178.0 178.1  Star Wars: The Clone Wars — \"Darkness on Umbara\"\n\n↑  Clone Trooper Dogma in the Databank (backup link)\n\n↑  Star Wars: The Clone Wars — \"Voices\"\n\n↑ 181.0 181.1 and Kanan 2\n\n↑ 182.0 182.1 182.2 182.3 182.4 Star Wars Jedi: Fallen Order\n\n↑ 183.0 183.1 183.2 A New Dawn\n\n↑ 184.0 184.1 Star Wars Rebels: The Siege of Lothal\n\n↑ 185.0 185.1 185.2 185.3 185.4  Star Wars Rebels — \"Fire Across the Galaxy\"\n\n↑ 186.0 186.1 186.2  \"The End of History\" — Star Wars Insider 154\n\n↑ 187.0 187.1  Star Wars Rebels — \"Rise of the Old Masters\"\n\n↑ Darth Vader (2017) 19\n\n↑ 189.0 189.1 Aftermath: Life Debt\n\n↑ Lando 3\n\n↑ Star Wars: Absolutely Everything You Need to Know, Updated and Expanded\n\n↑  Mustafar in the Databank (backup link)\n\n↑ Star Wars (2015) 10\n\n↑ Jedi Training: Trials of the Temple\n\n↑ 195.0 195.1 195.2 Star Wars Rebels: Spark of Rebellion\n\n↑  \"Eyes on the Prize\" — Star Wars Rebels Magazine 6\n\n↑  Star Wars Rebels — \"Gathering Forces\"\n\n↑ 198.0 198.1 198.2 198.3 198.4 198.5 198.6 198.7 198.8 Star Wars: Episode IX The Rise of Skywalker\n\n↑ Star Wars LINE Webtoon\n\n↑  Lor San Tekka in the Databank (backup link)\n\n↑  The Mandalorian — \"Chapter 16: The Rescue\"\n\n↑  The Book of Boba Fett — \"Chapter 7: In the Name of Honor\"\n\n↑ 203.0 203.1 The Rise of Kylo Ren 3\n\n↑ 204.0 204.1 204.2 The Rise of Kylo Ren 1\n\n↑ Star Wars: Timelines dates the events of Shadow of the Sith to 21 ABY.\n\n↑ 206.0 206.1 206.2 Star Wars: The Force Awakens novelization\n\n↑ 207.0 207.1 The Rise of Kylo Ren 4\n\n↑  Supreme Leader Kylo Ren in the Databank (backup link)\n\n↑ Star Wars: The Last Jedi: Expanded Edition\n\n↑ 210.0 210.1  Empire, the in the Databank (content now obsolete; backup link)\n\n↑ The Making of Star Wars: The Definitive Story Behind the Original Film\n\n↑ Star Wars: Episode I The Phantom Menace Scrapbook\n\n↑ Star Wars: The Force Awakens: A Junior Novel\n\n↑ The Star Wars Archives: Episodes I–III, 1999–2005\n\n\n\n\n\n\nHistory of the Jedi\n\n\n\n\n\nPrime Jedi · Jedi Order · Entruvia Conflict · Attack on GarnHundred-Year Darkness · Sith war (Battle of Coruscant) · Great Hyperspace WarGreat Scourge of Malachor · Crusade of Krath · Sith Wars · Great Sith War · Resurgence of the SithMandalorian-Jedi War · Jedi-Sith War · Fall of the Old Republic (Sacking of the Jedi Temple)Darth Momin's destruction of a city · Battle of Takodana · Jedi–Zygerrian conflict · Nihil conflictSkirmish on the moon of Drazkel · Naboo Crisis · Open-Closed WarSeparatist Crisis · Clone Wars · Mandalorian civil war · Great Jedi Purge · Early rebellionGalactic Civil War · Destruction of the Jedi Temple · First Order-Resistance War\n\n\n\n\n [edit]\n\n\n\n\nThe Convocation of the Force (382 BBY)\n\n\n\n\n\nChurch of the ForceKilan T'Dara (Chair)\n\n\n\nJedi OrderLeebon→Vildar Mac\nSorcerers of TundTarna Miak\nDisciples of the WhillsElris Florent\n\n\nFallanassiSirené\nMatukaiWaran Val\nLontoSusalee\n\n\nGuardians of the WhillsUnidentified representative\nIndependently→Tey Sirrek\n\n\n\nIn other languages\n\n\nčeštinaΕλληνικάespañolfrançais한국어italianoქართული日本語polskiportuguêssuomiTürkçeукраїнська\n\n\n\n\n\n"
}